
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 8-core  perpetual
Serial number: 501706333265
  Licensed to: Marius Zoican
               University of Toronto

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do regression_quiz_jackknife.do 

. // Load data
. // -------------------------------------
. clear all

. set more off

. 
. cd ..
D:\Research\gamification_investor_behavior

. local directory : pwd

. display "`working_dir'"


. import delimited "`directory'\data_processed\self_reflection"
(encoding automatically selected: ISO-8859-1)
(21 vars, 951 obs)

. save "`directory'\data_processed\self_reflection.dta", replace
file
    D:\Research\gamification_investor_behavior\data_processed\self_reflection
    > .dta saved

. clear

. import delimited "`directory'\data_processed\jackknife_finquiz.csv"
(encoding automatically selected: UTF-8)
(13 vars, 963 obs)

. save "`directory'\data_processed\jackknife_finquiz.dta", replace
file
    D:\Research\gamification_investor_behavior\data_processed\jackknife_finqu
    > iz.dta saved

. 
. use self_reflection.dta, clear
file self_reflection.dta not found
r(601);

end of do-file
r(601);
