
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 8-core  perpetual
Serial number: 501706333265
  Licensed to: Marius Zoican
               University of Toronto

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do regression_trader_round.do 

. // Load data
. // -------------------------------------
. clear all

. set more off

. 
. cd ..
D:\Research\gamification_investor_behavior

. local directory : pwd

. display "`working_dir'"


. import delimited "`directory'\data_processed\panel_trader_round"
(encoding automatically selected: ISO-8859-1)
(41 vars, 3,197 obs)

. 
. 
. // encode experimental session
. encode playerinner_name, generate(exp_session)

. // // Label variables
. // // ---------------------------------
. 
. egen age_std = std(playerage)

. gen d_gender = (playergender == "Female")

. egen finquiz_std = std(playerpayoff)

. egen finknowledge_std = std(playerknowledge)

. 
. gen d_knowledge = (finknowledge_std > 0)

. 
. 
. label variable excessive_trading "Excessive trading"

. label variable gamified "Gamified"

. label variable age_std "Age"

. label variable d_gender "Gender (female)"

. label variable finquiz_std "Financial quiz score"

. label variable playertrading_experience "Trading experience"

. label variable salient "Salient purchase price"

. label variable playercourse_financial "Finance course taken"

. label variable finknowledge_std "Self-assessed financial literacy"

. label variable d_knowledge "Dummy Self-assessed financial literacy"

. label variable prediction_accuracy "Prediction accuracy"

. label variable ingame_experience "In-game experience"

. label variable accuracy_pred_zero "First-tick prediction"

. 
. egen prediction_accuracy_std = std(prediction_accuracy)
(28 missing values generated)

. 
. // Define a list of controls
. local controls salient age_std d_gender finquiz_std finknowledge_std playertr
> ading_experience playercourse_financial prediction_accuracy_std

. local controls_2 salient age_std d_gender finquiz_std finknowledge_std player
> trading_experience playercourse_financial

. local controls_3 salient age_std d_gender finquiz_std d_knowledge playertradi
> ng_experience playercourse_financial prediction_accuracy_std

. local controls_4 salient age_std d_gender finquiz_std d_knowledge playertradi
> ng_experience playercourse_financial

. 
. 
. gen bias_buy = 10000 * (filtered_prob_buy - 0.5)
(117 missing values generated)

. gen bias_sell = 10000 * (filtered_prob_sell - 0.5)

. 
. gen prefers_game = (playersr_prefs == "Design 2")

. gen game_prefers_interact = gamified * prefers_game

. gen nongame_prefers_interact = gamified * (1 - prefers_game)

. 
. label variable prefers_game "Prefers gamified"

. label variable game_prefers_interact "Gamified $\times$ Prefers gamified"

. label variable nongame_prefers_interact "Gamified $\times$ Prefers non-gamifi
> ed"

. 
. gen ds1 = (playerinner_name == "s1")

. gen ds2 = (playerinner_name == "s2")

. gen ds3 = (playerinner_name == "s3")

. gen ds4 = (playerinner_name == "s4")

. 
. gen gamified_ds1 = gamified * ds1

. gen gamified_ds2 = gamified * ds2

. gen gamified_ds3 = gamified * ds3

. gen gamified_ds4 = gamified * ds4

. 
. 
. // Table 4
. 
. reghdfe excessive_trading gamified `controls' if playerinner_name =="s1", abs
> orb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(   9,    317) =       2.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0104
                                                  R-squared       =     0.0400
                                                  Adj R-squared   =     0.0291
                                                  Within R-sq.    =     0.0351
Number of clusters (participant_code) =        318Root MSE        =     0.4176

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0330166   .0181328     1.82   0.070    -.0026593    .0686925
     salient |  -.0121212   .0186946    -0.65   0.517    -.0489023    .0246599
     age_std |  -.0093624   .0352067    -0.27   0.790    -.0786306    .0599059
    d_gender |  -.0321523   .0413057    -0.78   0.437    -.1134204    .0491157
 finquiz_std |  -.0502491   .0237101    -2.12   0.035    -.0968981   -.0036001
finknowled~d |   .0318203   .0208174     1.53   0.127    -.0091375    .0727781
playertrad~e |   .1104409   .0463401     2.38   0.018     .0192678     .201614
playercour~l |  -.0018126   .0605304    -0.03   0.976    -.1209046    .1172795
prediction~d |  -.0168549   .0138053    -1.22   0.223    -.0440165    .0103067
       _cons |   .5835104      .0376    15.52   0.000     .5095334    .6574875
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_4.tex", adjr2 replace tex tstat 
> label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_4.tex
dir : seeout

. 
. reghdfe excessive_trading gamified `controls' if playerinner_name =="s1" & pl
> ayersr_prefs=="Design 1", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        601
Absorbing 1 HDFE group                            F(   9,    177) =       1.56
Statistics robust to heteroskedasticity           Prob > F        =     0.1310
                                                  R-squared       =     0.0632
                                                  Adj R-squared   =     0.0441
                                                  Within R-sq.    =     0.0564
Number of clusters (participant_code) =        178Root MSE        =     0.3633

                     (Std. err. adjusted for 178 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0037527   .0233681     0.16   0.873    -.0423633    .0498687
     salient |   .0022884   .0194306     0.12   0.906    -.0360571    .0406339
     age_std |  -.0867339   .0371574    -2.33   0.021    -.1600623   -.0134054
    d_gender |  -.0168972   .0458685    -0.37   0.713    -.1074167    .0736224
 finquiz_std |   .0299698   .0283067     1.06   0.291    -.0258922    .0858318
finknowled~d |   .0314318   .0230652     1.36   0.175    -.0140864    .0769499
playertrad~e |   .0918783   .0534814     1.72   0.088     -.013665    .1974215
playercour~l |  -.0983245    .070555    -1.39   0.165    -.2375618    .0409127
prediction~d |  -.0040346   .0146069    -0.28   0.783    -.0328608    .0247915
       _cons |   .5313832   .0433478    12.26   0.000     .4458381    .6169283
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_4.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_4.tex
dir : seeout

. 
. reghdfe excessive_trading gamified `controls' if playerinner_name =="s1" & pl
> ayersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        462
Absorbing 1 HDFE group                            F(   9,    139) =       2.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0047
                                                  R-squared       =     0.0905
                                                  Adj R-squared   =     0.0662
                                                  Within R-sq.    =     0.0856
Number of clusters (participant_code) =        140Root MSE        =     0.4553

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0785683   .0301111     2.61   0.010     .0190332    .1381034
     salient |  -.0183215   .0340247    -0.54   0.591    -.0855945    .0489514
     age_std |   .1087563   .0658544     1.65   0.101    -.0214495    .2389621
    d_gender |  -.0962864   .0720334    -1.34   0.184    -.2387092    .0461364
 finquiz_std |  -.1143657   .0335772    -3.41   0.001    -.1807538   -.0479777
finknowled~d |   .0167869   .0356267     0.47   0.638    -.0536535    .0872273
playertrad~e |   .1392552   .0777693     1.79   0.076    -.0145085    .2930189
playercour~l |    .094548   .0962921     0.98   0.328    -.0958386    .2849346
prediction~d |  -.0316938   .0245088    -1.29   0.198    -.0801521    .0167645
       _cons |   .6439951   .0621508    10.36   0.000     .5211119    .7668784
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_4.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_4.tex
dir : seeout

. 
. reghdfe excessive_trading gamified `controls' if playerinner_name =="s1" & pl
> ayersr_badges==1, absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        228
Absorbing 1 HDFE group                            F(   9,     67) =       0.93
Statistics robust to heteroskedasticity           Prob > F        =     0.5033
                                                  R-squared       =     0.0651
                                                  Adj R-squared   =     0.0130
                                                  Within R-sq.    =     0.0452
Number of clusters (participant_code) =         68Root MSE        =     0.3153

                      (Std. err. adjusted for 68 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0073619   .0294977     0.25   0.804    -.0515157    .0662395
     salient |   .0136584   .0283276     0.48   0.631    -.0428837    .0702005
     age_std |   -.070092   .0493466    -1.42   0.160    -.1685882    .0284043
    d_gender |  -.0205348   .0711146    -0.29   0.774    -.1624802    .1214106
 finquiz_std |   .0452985   .0521587     0.87   0.388    -.0588107    .1494077
finknowled~d |   .0115784   .0381782     0.30   0.763    -.0646257    .0877825
playertrad~e |  -.0104305   .0859913    -0.12   0.904    -.1820699    .1612089
playercour~l |   .0308489   .0942136     0.33   0.744    -.1572023    .2189001
prediction~d |   .0145655   .0226222     0.64   0.522    -.0305887    .0597197
       _cons |   .4626686   .0755415     6.12   0.000     .3118871    .6134501
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_4.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_4.tex
dir : seeout

. 
. reghdfe excessive_trading gamified `controls' if playerinner_name =="s1" & pl
> ayersr_badges==2, absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        134
Absorbing 1 HDFE group                            F(   9,     41) =       1.59
Statistics robust to heteroskedasticity           Prob > F        =     0.1514
                                                  R-squared       =     0.1501
                                                  Adj R-squared   =     0.0658
                                                  Within R-sq.    =     0.1228
Number of clusters (participant_code) =         42Root MSE        =     0.3645

                      (Std. err. adjusted for 42 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0034752   .0533265     0.07   0.948    -.1042199    .1111703
     salient |   .0276195   .0433508     0.64   0.528    -.0599293    .1151682
     age_std |  -.1366317   .1105723    -1.24   0.224    -.3599369    .0866736
    d_gender |  -.1227514   .0842771    -1.46   0.153    -.2929524    .0474497
 finquiz_std |  -.0022354   .0518699    -0.04   0.966    -.1069888    .1025179
finknowled~d |  -.0775219    .064141    -1.21   0.234    -.2070572    .0520135
playertrad~e |   .1393681   .0742902     1.88   0.068     -.010664    .2894002
playercour~l |   .0764978   .1310625     0.58   0.563    -.1881882    .3411838
prediction~d |  -.0210948   .0285248    -0.74   0.464    -.0787017    .0365121
       _cons |   .5803302   .0865181     6.71   0.000     .4056034    .7550571
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_4.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_4.tex
dir : seeout

. 
. reghdfe excessive_trading gamified `controls' if playerinner_name =="s1" & pl
> ayersr_badges==3, absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        260
Absorbing 1 HDFE group                            F(   9,     77) =       1.30
Statistics robust to heteroskedasticity           Prob > F        =     0.2526
                                                  R-squared       =     0.0837
                                                  Adj R-squared   =     0.0392
                                                  Within R-sq.    =     0.0783
Number of clusters (participant_code) =         78Root MSE        =     0.3545

                      (Std. err. adjusted for 78 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0130876   .0348562     0.38   0.708    -.0563199    .0824951
     salient |   .0125614   .0325458     0.39   0.701    -.0522456    .0773683
     age_std |   .0193682   .0540285     0.36   0.721    -.0882163    .1269526
    d_gender |   -.124982   .0665606    -1.88   0.064    -.2575211    .0075572
 finquiz_std |    -.02105   .0459492    -0.46   0.648    -.1125465    .0704465
finknowled~d |   .0218378   .0296031     0.74   0.463    -.0371096    .0807851
playertrad~e |    .143195   .0731505     1.96   0.054    -.0024663    .2888563
playercour~l |  -.0976228   .0968459    -1.01   0.317    -.2904677    .0952221
prediction~d |  -.0252894   .0219251    -1.15   0.252    -.0689479     .018369
       _cons |   .5910614   .0510842    11.57   0.000     .4893396    .6927831
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_4.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_4.tex
dir : seeout

. 
. reghdfe excessive_trading gamified `controls' if playerinner_name =="s1" & pl
> ayersr_badges==4, absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        246
Absorbing 1 HDFE group                            F(   9,     69) =       3.14
Statistics robust to heteroskedasticity           Prob > F        =     0.0031
                                                  R-squared       =     0.1377
                                                  Adj R-squared   =     0.0933
                                                  Within R-sq.    =     0.1319
Number of clusters (participant_code) =         70Root MSE        =     0.4311

                      (Std. err. adjusted for 70 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0124562   .0501147     0.25   0.804    -.0875199    .1124323
     salient |  -.0136636    .048693    -0.28   0.780    -.1108034    .0834762
     age_std |  -.0356495   .0633264    -0.56   0.575    -.1619823    .0906833
    d_gender |   .0770786   .0861349     0.89   0.374    -.0947558     .248913
 finquiz_std |  -.0920091    .046519    -1.98   0.052     -.184812    .0007938
finknowled~d |   .0723061   .0480823     1.50   0.137    -.0236155    .1682277
playertrad~e |   .2381846   .0948201     2.51   0.014     .0490237    .4273455
playercour~l |  -.2602674   .1107394    -2.35   0.022    -.4811865   -.0393483
prediction~d |  -.0120615   .0261128    -0.46   0.646    -.0641551    .0400321
       _cons |   .5568501   .0888106     6.27   0.000     .3796777    .7340225
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_4.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_4.tex
dir : seeout

. 
. reghdfe excessive_trading gamified `controls' if playerinner_name =="s1" & pl
> ayersr_badges==5, absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        195
Absorbing 1 HDFE group                            F(   9,     59) =       4.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.1757
                                                  Adj R-squared   =     0.1213
                                                  Within R-sq.    =     0.1662
Number of clusters (participant_code) =         60Root MSE        =     0.4970

                      (Std. err. adjusted for 60 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .1579652   .0412757     3.83   0.000     .0753727    .2405576
     salient |  -.0578054   .0472076    -1.22   0.226    -.1522675    .0366567
     age_std |   .1908501   .1130386     1.69   0.097    -.0353397    .4170398
    d_gender |  -.0807357   .1565125    -0.52   0.608    -.3939165     .232445
 finquiz_std |  -.0305783    .051298    -0.60   0.553    -.1332254    .0720688
finknowled~d |   .0394731   .0472293     0.84   0.407    -.0550325    .1339788
playertrad~e |  -.0189698   .1766624    -0.11   0.915    -.3724704    .3345309
playercour~l |   .4430412      .2044     2.17   0.034     .0340378    .8520447
prediction~d |   .0011959   .0396702     0.03   0.976    -.0781839    .0805757
       _cons |   .7544472   .1199067     6.29   0.000     .5145144    .9943799
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_4.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_4.tex
dir : seeout

. 
. 
. // Table 5
. 
. reghdfe bias_buy prefers_game  `controls' if playerinner_name =="s1", absorb(
> round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,046
Absorbing 1 HDFE group                            F(   9,    316) =       6.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1039
                                                  Adj R-squared   =     0.0935
                                                  Within R-sq.    =     0.0696
Number of clusters (participant_code) =        317Root MSE        =   245.1373

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prefers_game |   64.67597   21.58001     3.00   0.003     22.21731    107.1346
     salient |  -23.04661   11.45083    -2.01   0.045    -45.57612   -.5171035
     age_std |  -41.30284   18.45372    -2.24   0.026    -77.61052   -4.995149
    d_gender |  -27.86349   21.82388    -1.28   0.203    -70.80197    15.07499
 finquiz_std |  -36.20155   11.14968    -3.25   0.001    -58.13854   -14.26456
finknowled~d |   16.75886   11.77077     1.42   0.155     -6.40012    39.91785
playertrad~e |   66.36998   22.99163     2.89   0.004     21.13396     111.606
playercour~l |  -60.79479   31.28857    -1.94   0.053     -122.355    .7654523
prediction~d |   5.587956   7.859101     0.71   0.478    -9.874823    21.05073
       _cons |  -275.0668   23.62981   -11.64   0.000    -321.5584   -228.5752
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_5.tex", adjr2 replace tex tstat 
> label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_5.tex
dir : seeout

. 
. reghdfe bias_buy prefers_game game_prefers_interact nongame_prefers_interact 
>  `controls' if playerinner_name =="s1", absorb(round_number) vce(cl participa
> nt_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,046
Absorbing 1 HDFE group                            F(  11,    316) =       5.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1048
                                                  Adj R-squared   =     0.0926
                                                  Within R-sq.    =     0.0704
Number of clusters (participant_code) =        317Root MSE        =   245.2596

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prefers_game |   49.76952   25.91721     1.92   0.056    -1.222586    100.7616
game_prefe~t |   18.62129   19.75706     0.94   0.347    -20.25072     57.4933
nongame_pr~t |  -11.91974   19.29001    -0.62   0.537    -49.87282    26.03334
     salient |  -22.95077   11.44833    -2.00   0.046    -45.47534   -.4261965
     age_std |  -41.62672    18.4633    -2.25   0.025    -77.95326   -5.300184
    d_gender |  -27.58987   21.85077    -1.26   0.208    -70.58126    15.40151
 finquiz_std |  -36.35763    11.1574    -3.26   0.001    -58.30981   -14.40546
finknowled~d |   16.84289   11.78509     1.43   0.154     -6.34426    40.03004
playertrad~e |     66.701   23.01874     2.90   0.004     21.41163    111.9904
playercour~l |  -61.03255   31.33171    -1.95   0.052    -122.6777    .6125787
prediction~d |   5.621632   7.864119     0.71   0.475    -9.851019    21.09428
       _cons |  -269.5289   25.80952   -10.44   0.000    -320.3092   -218.7487
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_5.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_5.tex
dir : seeout

. 
. reghdfe bias_sell prefers_game  `controls' if playerinner_name =="s1", absorb
> (round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(   9,    317) =       2.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0054
                                                  R-squared       =     0.0837
                                                  Adj R-squared   =     0.0733
                                                  Within R-sq.    =     0.0361
Number of clusters (participant_code) =        318Root MSE        =   232.8459

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prefers_game |  -40.44424   20.57498    -1.97   0.050    -80.92502    .0365375
     salient |  -5.125121   11.89732    -0.43   0.667     -28.5328    18.28256
     age_std |   13.75731   18.09318     0.76   0.448    -21.84059    49.35521
    d_gender |   3.140214   20.63014     0.15   0.879    -37.44909    43.72951
 finquiz_std |   23.89303   10.72453     2.23   0.027     2.792785    44.99328
finknowled~d |  -21.37695   12.32817    -1.73   0.084    -45.63232    2.878415
playertrad~e |  -54.06935   21.08676    -2.56   0.011    -95.55703   -12.58166
playercour~l |   40.56556   31.71867     1.28   0.202    -21.84016    102.9713
prediction~d |   3.706499   7.912243     0.47   0.640    -11.86065    19.27364
       _cons |   294.3317   21.00309    14.01   0.000     253.0086    335.6548
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_5.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_5.tex
dir : seeout

. 
. reghdfe bias_sell prefers_game game_prefers_interact nongame_prefers_interact
>   `controls' if playerinner_name =="s1", absorb(round_number) vce(cl particip
> ant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(  11,    317) =       2.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0038
                                                  R-squared       =     0.0861
                                                  Adj R-squared   =     0.0739
                                                  Within R-sq.    =     0.0386
Number of clusters (participant_code) =        318Root MSE        =   232.7636

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prefers_game |  -23.57593   23.95554    -0.98   0.326    -70.70787    23.55602
game_prefe~t |  -36.27872    16.7543    -2.17   0.031     -69.2424   -3.315052
nongame_pr~t |  -1.344055     16.854    -0.08   0.936     -34.5039    31.81579
     salient |  -5.201328   11.90219    -0.44   0.662     -28.6186    18.21594
     age_std |   13.97371   18.13543     0.77   0.442    -21.70731    49.65473
    d_gender |   3.022486   20.63655     0.15   0.884    -37.57942    43.62439
 finquiz_std |   24.04019    10.7093     2.24   0.025     2.969912    45.11047
finknowled~d |  -21.72022   12.32609    -1.76   0.079    -45.97151    2.531061
playertrad~e |   -54.2019   21.11521    -2.57   0.011    -95.74557   -12.65823
playercour~l |   40.74226   31.72833     1.28   0.200    -21.68245     103.167
prediction~d |   3.642151   7.899847     0.46   0.645    -11.90061    19.18491
       _cons |   295.1293   22.82923    12.93   0.000     250.2133    340.0452
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_5.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_5.tex
dir : seeout

. 
. reghdfe plr prefers_game  `controls' if playerinner_name =="s1", absorb(round
> _number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,062
Absorbing 1 HDFE group                            F(   9,    317) =       3.26
Statistics robust to heteroskedasticity           Prob > F        =     0.0008
                                                  R-squared       =     0.0569
                                                  Adj R-squared   =     0.0461
                                                  Within R-sq.    =     0.0479
Number of clusters (participant_code) =        318Root MSE        =     0.1848

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
         plr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prefers_game |   .0315543   .0185541     1.70   0.090    -.0049505    .0680591
     salient |  -.0097335   .0080302    -1.21   0.226    -.0255328    .0060658
     age_std |      -.008   .0154354    -0.52   0.605    -.0383688    .0223687
    d_gender |  -.0052496   .0171249    -0.31   0.759    -.0389423    .0284432
 finquiz_std |   -.031688   .0099638    -3.18   0.002    -.0512916   -.0120844
finknowled~d |   .0156551   .0098546     1.59   0.113    -.0037335    .0350437
playertrad~e |   .0448036   .0182231     2.46   0.014     .0089501     .080657
playercour~l |  -.0029411    .027302    -0.11   0.914    -.0566571     .050775
prediction~d |  -.0024398   .0054503    -0.45   0.655     -.013163    .0082834
       _cons |   .0867727   .0159708     5.43   0.000     .0553505    .1181949
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_5.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_5.tex
dir : seeout

. 
. reghdfe plr prefers_game game_prefers_interact nongame_prefers_interact  `con
> trols' if playerinner_name =="s1", noabsorb vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,062
Absorbing 1 HDFE group                            F(  11,    317) =       2.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0013
                                                  R-squared       =     0.0479
                                                  Adj R-squared   =     0.0379
                                                  Within R-sq.    =     0.0479
Number of clusters (participant_code) =        318Root MSE        =     0.1855

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
         plr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prefers_game |   .0261449   .0206901     1.26   0.207    -.0145624    .0668523
game_prefe~t |   .0076186   .0127254     0.60   0.550    -.0174182    .0326554
nongame_pr~t |  -.0041498   .0116433    -0.36   0.722    -.0270577    .0187582
     salient |  -.0104677   .0081715    -1.28   0.201     -.026545    .0056096
     age_std |   -.007682   .0154581    -0.50   0.620    -.0380955    .0227315
    d_gender |  -.0056679   .0171151    -0.33   0.741    -.0393414    .0280055
 finquiz_std |  -.0320773   .0099402    -3.23   0.001    -.0516344   -.0125201
finknowled~d |   .0152343   .0098119     1.55   0.122    -.0040704     .034539
playertrad~e |   .0444234   .0182701     2.43   0.016     .0084774    .0803694
playercour~l |   -.003239   .0273214    -0.12   0.906    -.0569931    .0505152
prediction~d |   .0053313   .0044365     1.20   0.230    -.0033974    .0140599
       _cons |   .0898136   .0175227     5.13   0.000     .0553381    .1242891
------------------------------------------------------------------------------

. outreg2 using "`directory'\tables\main_table_5.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_5.tex
dir : seeout

. 
. reghdfe pgr prefers_game  `controls' if playerinner_name =="s1", absorb(round
> _number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,058
Absorbing 1 HDFE group                            F(   9,    316) =       3.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0004
                                                  R-squared       =     0.0840
                                                  Adj R-squared   =     0.0735
                                                  Within R-sq.    =     0.0323
Number of clusters (participant_code) =        317Root MSE        =     0.2106

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
         pgr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prefers_game |   .0317025   .0174369     1.82   0.070    -.0026046    .0660096
     salient |   .0429107   .0104688     4.10   0.000     .0223133     .063508
     age_std |   .0045308   .0150951     0.30   0.764    -.0251689    .0342305
    d_gender |   .0117026   .0186234     0.63   0.530    -.0249389    .0483442
 finquiz_std |   .0150484    .009584     1.57   0.117    -.0038082    .0339049
finknowled~d |  -.0015675   .0098908    -0.16   0.874    -.0210278    .0178927
playertrad~e |   .0355907   .0214273     1.66   0.098    -.0065675    .0777489
playercour~l |   .0148436   .0253332     0.59   0.558    -.0349994    .0646866
prediction~d |   -.007835   .0068021    -1.15   0.250    -.0212181    .0055481
       _cons |   .2693409   .0214496    12.56   0.000     .2271389     .311543
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_5.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_5.tex
dir : seeout

. 
. reghdfe pgr prefers_game game_prefers_interact nongame_prefers_interact  `con
> trols' if playerinner_name =="s1", absorb(round_number) vce(cl participant_co
> de)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,058
Absorbing 1 HDFE group                            F(  11,    316) =       3.08
Statistics robust to heteroskedasticity           Prob > F        =     0.0006
                                                  R-squared       =     0.0852
                                                  Adj R-squared   =     0.0730
                                                  Within R-sq.    =     0.0335
Number of clusters (participant_code) =        317Root MSE        =     0.2107

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
         pgr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
prefers_game |    .031954   .0213642     1.50   0.136    -.0100801     .073988
game_prefe~t |   .0152355   .0181698     0.84   0.402    -.0205136    .0509846
nongame_pr~t |   .0153729   .0164878     0.93   0.352    -.0170669    .0478126
     salient |   .0429077   .0104689     4.10   0.000     .0223102    .0635053
     age_std |   .0046701   .0151471     0.31   0.758    -.0251318    .0344721
    d_gender |   .0116353   .0186447     0.62   0.533    -.0250481    .0483187
 finquiz_std |   .0151264    .009589     1.58   0.116      -.00374    .0339927
finknowled~d |  -.0013121   .0099422    -0.13   0.895    -.0208734    .0182492
playertrad~e |   .0352674    .021468     1.64   0.101    -.0069708    .0775057
playercour~l |   .0150115   .0253523     0.59   0.554    -.0348691    .0648921
prediction~d |   -.007836   .0068211    -1.15   0.252    -.0212564    .0055844
       _cons |   .2618854   .0228527    11.46   0.000     .2169227    .3068482
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_5.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_5.tex
dir : seeout

. 
. 
. // Table 7
. 
. reghdfe plr  gamified `controls'  ingame_experience accuracy_pred_zero if pla
> yerinner_name =="s2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,056
Absorbing 1 HDFE group                            F(  11,    316) =       3.40
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.1063
                                                  Adj R-squared   =     0.0943
                                                  Within R-sq.    =     0.0758
Number of clusters (participant_code) =        317Root MSE        =     0.1518

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
         plr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0092727   .0070707     1.31   0.191     -.004639    .0231844
     salient |  -.0131603   .0064878    -2.03   0.043     -.025925   -.0003956
     age_std |    .000111   .0032299     0.03   0.973    -.0062439    .0064659
    d_gender |  -.0341505   .0159556    -2.14   0.033    -.0655432   -.0027577
 finquiz_std |  -.0312565   .0086598    -3.61   0.000    -.0482947   -.0142183
finknowled~d |   .0148025   .0080985     1.83   0.069    -.0011314    .0307364
playertrad~e |   .0082166   .0196942     0.42   0.677    -.0305317     .046965
playercour~l |   -.053559   .0177628    -3.02   0.003    -.0885073   -.0186107
prediction~d |  -.0109037   .0056873    -1.92   0.056    -.0220934     .000286
ingame_exp~e |   .0044786   .0140576     0.32   0.750    -.0231797    .0321369
accuracy_p~o |   .0711181   .0194244     3.66   0.000     .0329006    .1093356
       _cons |   .0818701   .0158466     5.17   0.000     .0506919    .1130483
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 replace tex tstat 
> label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe pgr  gamified `controls'  ingame_experience accuracy_pred_zero if pla
> yerinner_name =="s2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,051
Absorbing 1 HDFE group                            F(  11,    316) =       2.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0051
                                                  R-squared       =     0.0877
                                                  Adj R-squared   =     0.0754
                                                  Within R-sq.    =     0.0421
Number of clusters (participant_code) =        317Root MSE        =     0.1989

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
         pgr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0006954   .0107165    -0.06   0.948    -.0217801    .0203893
     salient |   .0115307   .0105499     1.09   0.275    -.0092263    .0322877
     age_std |   .0042088   .0051962     0.81   0.419    -.0060148    .0144324
    d_gender |  -.0663254   .0194912    -3.40   0.001    -.1046744   -.0279764
 finquiz_std |   .0037928   .0093476     0.41   0.685    -.0145987    .0221842
finknowled~d |   2.58e-06   .0095017     0.00   1.000    -.0186919    .0186971
playertrad~e |   .0095457   .0200303     0.48   0.634    -.0298639    .0489552
playercour~l |  -.0515942   .0255267    -2.02   0.044    -.1018181   -.0013703
prediction~d |  -.0064966   .0076753    -0.85   0.398    -.0215978    .0086046
ingame_exp~e |  -.0018426   .0173975    -0.11   0.916    -.0360721     .032387
accuracy_p~o |    .072242   .0275797     2.62   0.009     .0179788    .1265051
       _cons |   .3026784   .0239267    12.65   0.000     .2556027    .3497541
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe plr_alerts  gamified `controls'  ingame_experience accuracy_pred_zero
>  if playerinner_name =="s2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,044
Absorbing 1 HDFE group                            F(  11,    315) =       3.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.0814
                                                  Adj R-squared   =     0.0689
                                                  Within R-sq.    =     0.0679
Number of clusters (participant_code) =        316Root MSE        =     0.1725

                     (Std. err. adjusted for 316 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  plr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0044367   .0094527     0.47   0.639    -.0141618    .0230351
     salient |  -.0266887   .0099851    -2.67   0.008    -.0463346   -.0070428
     age_std |   .0013116   .0038159     0.34   0.731    -.0061963    .0088195
    d_gender |  -.0217502   .0158733    -1.37   0.172    -.0529814     .009481
 finquiz_std |  -.0372235   .0098845    -3.77   0.000    -.0566716   -.0177755
finknowled~d |   .0170521   .0079285     2.15   0.032     .0014526    .0326516
playertrad~e |  -.0013014   .0198847    -0.07   0.948    -.0404249    .0378222
playercour~l |  -.0414736   .0171373    -2.42   0.016    -.0751916   -.0077556
prediction~d |  -.0030437    .007062    -0.43   0.667    -.0169384     .010851
ingame_exp~e |   .0128781   .0139697     0.92   0.357    -.0146075    .0403638
accuracy_p~o |   .0713289   .0198118     3.60   0.000     .0323487    .1103092
       _cons |   .0621708   .0178602     3.48   0.001     .0270305    .0973111
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe pgr_alerts  gamified `controls'  ingame_experience accuracy_pred_zero
>  if playerinner_name =="s2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        959
Absorbing 1 HDFE group                            F(  11,    315) =       2.15
Statistics robust to heteroskedasticity           Prob > F        =     0.0171
                                                  R-squared       =     0.0972
                                                  Adj R-squared   =     0.0838
                                                  Within R-sq.    =     0.0269
Number of clusters (participant_code) =        316Root MSE        =     0.3716

                     (Std. err. adjusted for 316 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  pgr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0565304   .0221602     2.55   0.011     .0129297    .1001311
     salient |   .0095129   .0221467     0.43   0.668    -.0340613    .0530871
     age_std |  -.0032594   .0075686    -0.43   0.667    -.0181509     .011632
    d_gender |  -.0352808   .0303294    -1.16   0.246    -.0949546    .0243931
 finquiz_std |   .0278959   .0165054     1.69   0.092    -.0045788    .0603706
finknowled~d |  -.0004662   .0150667    -0.03   0.975    -.0301102    .0291778
playertrad~e |  -.0065237   .0341418    -0.19   0.849    -.0736984     .060651
playercour~l |  -.0702102   .0430636    -1.63   0.104     -.154939    .0145185
prediction~d |  -.0036523   .0128861    -0.28   0.777     -.029006    .0217014
ingame_exp~e |  -.0728791   .0291581    -2.50   0.013    -.1302483   -.0155099
accuracy_p~o |   .0306678   .0522174     0.59   0.557    -.0720712    .1334068
       _cons |   .4630218   .0394321    11.74   0.000     .3854382    .5406055
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. 
. reghdfe plr  gamified `controls'  ingame_experience accuracy_pred_zero if pla
> yerinner_name =="s2" & prediction_accuracy<1, absorb(round_number) vce(cl par
> ticipant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        584
Absorbing 1 HDFE group                            F(  11,    296) =       2.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0264
                                                  R-squared       =     0.1477
                                                  Adj R-squared   =     0.1267
                                                  Within R-sq.    =     0.0878
Number of clusters (participant_code) =        297Root MSE        =     0.1501

                     (Std. err. adjusted for 297 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
         plr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0114264   .0099959    -1.14   0.254    -.0310984    .0082456
     salient |  -.0017777   .0106083    -0.17   0.867     -.022655    .0190997
     age_std |   .0007644   .0035558     0.21   0.830    -.0062334    .0077623
    d_gender |  -.0566253    .019796    -2.86   0.005    -.0955841   -.0176664
 finquiz_std |  -.0266224   .0099271    -2.68   0.008    -.0461589   -.0070858
finknowled~d |   .0096568    .009343     1.03   0.302    -.0087304    .0280439
playertrad~e |  -.0004831   .0246625    -0.02   0.984    -.0490191    .0480529
playercour~l |  -.0537914   .0228292    -2.36   0.019    -.0987196   -.0088633
prediction~d |  -.0352105    .013246    -2.66   0.008    -.0612787   -.0091423
ingame_exp~e |   .0226522    .016836     1.35   0.180    -.0104814    .0557857
accuracy_p~o |   .0592575   .0220848     2.68   0.008     .0157943    .1027206
       _cons |   .0603432   .0203195     2.97   0.003     .0203542    .1003321
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe pgr  gamified `controls'  ingame_experience accuracy_pred_zero if pla
> yerinner_name =="s2" & prediction_accuracy<1, absorb(round_number) vce(cl par
> ticipant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        581
Absorbing 1 HDFE group                            F(  11,    295) =       3.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0003
                                                  R-squared       =     0.1047
                                                  Adj R-squared   =     0.0825
                                                  Within R-sq.    =     0.0717
Number of clusters (participant_code) =        296Root MSE        =     0.2037

                     (Std. err. adjusted for 296 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
         pgr | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0082451   .0147752    -0.56   0.577    -.0373232     .020833
     salient |   .0223673   .0168739     1.33   0.186    -.0108411    .0555758
     age_std |   .0025384    .005065     0.50   0.617    -.0074297    .0125064
    d_gender |  -.0971052   .0242257    -4.01   0.000    -.1447823   -.0494282
 finquiz_std |   .0034032   .0110239     0.31   0.758    -.0182923    .0250986
finknowled~d |   .0053976   .0116508     0.46   0.644    -.0175316    .0283268
playertrad~e |   .0119379    .024715     0.48   0.629    -.0367022    .0605781
playercour~l |  -.0815661   .0302581    -2.70   0.007    -.1411151   -.0220171
prediction~d |   -.011218   .0186574    -0.60   0.548    -.0479365    .0255005
ingame_exp~e |  -.0033947   .0198844    -0.17   0.865     -.042528    .0357387
accuracy_p~o |   .0447726   .0329107     1.36   0.175    -.0199968    .1095421
       _cons |   .3333867   .0338486     9.85   0.000     .2667713    .4000021
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe plr_alerts  gamified `controls'  ingame_experience accuracy_pred_zero
>  if playerinner_name =="s2" & prediction_accuracy<1, absorb(round_number) vce
> (cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        581
Absorbing 1 HDFE group                            F(  11,    294) =       1.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0361
                                                  R-squared       =     0.1086
                                                  Adj R-squared   =     0.0866
                                                  Within R-sq.    =     0.0775
Number of clusters (participant_code) =        295Root MSE        =     0.1635

                     (Std. err. adjusted for 295 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  plr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0090156    .009922    -0.91   0.364    -.0285427    .0105114
     salient |   -.025627   .0132411    -1.94   0.054    -.0516863    .0004322
     age_std |   .0028943   .0044662     0.65   0.517    -.0058954    .0116841
    d_gender |  -.0359204   .0212405    -1.69   0.092    -.0777231    .0058823
 finquiz_std |  -.0331439   .0120108    -2.76   0.006    -.0567819   -.0095059
finknowled~d |   .0130585   .0097078     1.35   0.180    -.0060472    .0321642
playertrad~e |   .0037003   .0275324     0.13   0.893    -.0504853    .0578859
playercour~l |  -.0467913   .0227491    -2.06   0.041     -.091563   -.0020196
prediction~d |  -.0331626   .0154106    -2.15   0.032    -.0634916   -.0028336
ingame_exp~e |   .0257788   .0176852     1.46   0.146    -.0090269    .0605844
accuracy_p~o |   .0590551   .0205377     2.88   0.004     .0186356    .0994745
       _cons |   .0331185   .0245819     1.35   0.179    -.0152604    .0814973
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe pgr_alerts  gamified `controls'  ingame_experience accuracy_pred_zero
>  if playerinner_name =="s2" & prediction_accuracy<1, absorb(round_number) vce
> (cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        536
Absorbing 1 HDFE group                            F(  11,    289) =       2.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0088
                                                  R-squared       =     0.0835
                                                  Adj R-squared   =     0.0589
                                                  Within R-sq.    =     0.0510
Number of clusters (participant_code) =        290Root MSE        =     0.3776

                     (Std. err. adjusted for 290 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  pgr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0806993   .0324716     2.49   0.014     .0167884    .1446102
     salient |   .0053979   .0334952     0.16   0.872    -.0605276    .0713234
     age_std |   .0058763   .0089284     0.66   0.511    -.0116967    .0234493
    d_gender |  -.0761688   .0385614    -1.98   0.049    -.1520655    -.000272
 finquiz_std |   .0172835   .0203898     0.85   0.397    -.0228478    .0574149
finknowled~d |   .0132752   .0191272     0.69   0.488    -.0243712    .0509215
playertrad~e |  -.0103582    .043614    -0.24   0.812    -.0961994    .0754831
playercour~l |  -.0792339   .0549777    -1.44   0.151    -.1874414    .0289736
prediction~d |  -.0076872   .0318525    -0.24   0.809    -.0703795    .0550051
ingame_exp~e |  -.1163281   .0371995    -3.13   0.002    -.1895444   -.0431117
accuracy_p~o |  -.0505491   .0658722    -0.77   0.443    -.1801991    .0791009
       _cons |   .5554997   .0546087    10.17   0.000     .4480185    .6629808
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. 
. gen disp_effect=pgr_alerts-plr_alerts
(396 missing values generated)

. 
. reghdfe plr_alerts  gamified `controls'  ingame_experience accuracy_pred_zero
>  if playerinner_name =="s2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,044
Absorbing 1 HDFE group                            F(  11,    315) =       3.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.0814
                                                  Adj R-squared   =     0.0689
                                                  Within R-sq.    =     0.0679
Number of clusters (participant_code) =        316Root MSE        =     0.1725

                     (Std. err. adjusted for 316 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  plr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0044367   .0094527     0.47   0.639    -.0141618    .0230351
     salient |  -.0266887   .0099851    -2.67   0.008    -.0463346   -.0070428
     age_std |   .0013116   .0038159     0.34   0.731    -.0061963    .0088195
    d_gender |  -.0217502   .0158733    -1.37   0.172    -.0529814     .009481
 finquiz_std |  -.0372235   .0098845    -3.77   0.000    -.0566716   -.0177755
finknowled~d |   .0170521   .0079285     2.15   0.032     .0014526    .0326516
playertrad~e |  -.0013014   .0198847    -0.07   0.948    -.0404249    .0378222
playercour~l |  -.0414736   .0171373    -2.42   0.016    -.0751916   -.0077556
prediction~d |  -.0030437    .007062    -0.43   0.667    -.0169384     .010851
ingame_exp~e |   .0128781   .0139697     0.92   0.357    -.0146075    .0403638
accuracy_p~o |   .0713289   .0198118     3.60   0.000     .0323487    .1103092
       _cons |   .0621708   .0178602     3.48   0.001     .0270305    .0973111
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 replace tex tstat 
> label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe pgr_alerts  gamified `controls'  ingame_experience accuracy_pred_zero
>  if playerinner_name =="s2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        959
Absorbing 1 HDFE group                            F(  11,    315) =       2.15
Statistics robust to heteroskedasticity           Prob > F        =     0.0171
                                                  R-squared       =     0.0972
                                                  Adj R-squared   =     0.0838
                                                  Within R-sq.    =     0.0269
Number of clusters (participant_code) =        316Root MSE        =     0.3716

                     (Std. err. adjusted for 316 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  pgr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0565304   .0221602     2.55   0.011     .0129297    .1001311
     salient |   .0095129   .0221467     0.43   0.668    -.0340613    .0530871
     age_std |  -.0032594   .0075686    -0.43   0.667    -.0181509     .011632
    d_gender |  -.0352808   .0303294    -1.16   0.246    -.0949546    .0243931
 finquiz_std |   .0278959   .0165054     1.69   0.092    -.0045788    .0603706
finknowled~d |  -.0004662   .0150667    -0.03   0.975    -.0301102    .0291778
playertrad~e |  -.0065237   .0341418    -0.19   0.849    -.0736984     .060651
playercour~l |  -.0702102   .0430636    -1.63   0.104     -.154939    .0145185
prediction~d |  -.0036523   .0128861    -0.28   0.777     -.029006    .0217014
ingame_exp~e |  -.0728791   .0291581    -2.50   0.013    -.1302483   -.0155099
accuracy_p~o |   .0306678   .0522174     0.59   0.557    -.0720712    .1334068
       _cons |   .4630218   .0394321    11.74   0.000     .3854382    .5406055
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe disp_effect  gamified `controls'  ingame_experience accuracy_pred_zer
> o if playerinner_name =="s2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        945
Absorbing 1 HDFE group                            F(  11,    314) =       2.78
Statistics robust to heteroskedasticity           Prob > F        =     0.0018
                                                  R-squared       =     0.1218
                                                  Adj R-squared   =     0.1086
                                                  Within R-sq.    =     0.0447
Number of clusters (participant_code) =        315Root MSE        =     0.4107

                     (Std. err. adjusted for 315 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
 disp_effect | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0545506   .0234762     2.32   0.021     .0083601    .1007412
     salient |   .0371726   .0253843     1.46   0.144    -.0127722    .0871174
     age_std |  -.0039937   .0057715    -0.69   0.489    -.0153494     .007362
    d_gender |   -.011834   .0349924    -0.34   0.735    -.0806832    .0570153
 finquiz_std |   .0670911    .019166     3.50   0.001     .0293811    .1048011
finknowled~d |  -.0189137   .0181492    -1.04   0.298    -.0546231    .0167958
playertrad~e |  -.0013056   .0396792    -0.03   0.974    -.0793763    .0767651
playercour~l |  -.0318041   .0463623    -0.69   0.493     -.123024    .0594159
prediction~d |  -.0001807   .0140574    -0.01   0.990    -.0278393     .027478
ingame_exp~e |  -.0898807   .0336122    -2.67   0.008    -.1560144   -.0237471
accuracy_p~o |   -.044271    .059097    -0.75   0.454    -.1605472    .0720053
       _cons |   .4036103   .0465843     8.66   0.000     .3119534    .4952672
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. 
. reghdfe plr_alerts  gamified `controls_2'  ingame_experience accuracy_pred_ze
> ro if playerinner_name =="s2" & prediction_accuracy==1, absorb(round_number) 
> vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        463
Absorbing 1 HDFE group                            F(  10,    266) =       2.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0049
                                                  R-squared       =     0.0779
                                                  Adj R-squared   =     0.0512
                                                  Within R-sq.    =     0.0700
Number of clusters (participant_code) =        267Root MSE        =     0.1829

                     (Std. err. adjusted for 267 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  plr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0130641   .0170743     0.77   0.445     -.020554    .0466822
     salient |  -.0305018   .0171794    -1.78   0.077    -.0643266     .003323
     age_std |  -.0001204   .0037032    -0.03   0.974    -.0074117    .0071709
    d_gender |  -.0042853   .0194582    -0.22   0.826    -.0425971    .0340265
 finquiz_std |  -.0388747   .0136638    -2.85   0.005    -.0657776   -.0119718
finknowled~d |   .0213068    .010617     2.01   0.046     .0004027    .0422109
playertrad~e |  -.0140768   .0224963    -0.63   0.532    -.0583702    .0302167
playercour~l |  -.0407617   .0248331    -1.64   0.102     -.089656    .0081327
ingame_exp~e |   .0023821   .0187021     0.13   0.899    -.0344408     .039205
accuracy_p~o |   .0644695   .0346922     1.86   0.064    -.0038369    .1327758
       _cons |   .0740309   .0259057     2.86   0.005     .0230247    .1250371
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe pgr_alerts  gamified `controls_2'  ingame_experience accuracy_pred_ze
> ro if playerinner_name =="s2" & prediction_accuracy==1, absorb(round_number) 
> vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        423
Absorbing 1 HDFE group                            F(  10,    260) =       1.39
Statistics robust to heteroskedasticity           Prob > F        =     0.1827
                                                  R-squared       =     0.1365
                                                  Adj R-squared   =     0.1091
                                                  Within R-sq.    =     0.0273
Number of clusters (participant_code) =        261Root MSE        =     0.3626

                     (Std. err. adjusted for 261 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  pgr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0562364   .0407853     1.38   0.169    -.0240753     .136548
     salient |   .0093901   .0345871     0.27   0.786    -.0587163    .0774965
     age_std |  -.0142768   .0072088    -1.98   0.049    -.0284719   -.0000817
    d_gender |   .0143595   .0387655     0.37   0.711    -.0619748    .0906938
 finquiz_std |   .0375605   .0212844     1.76   0.079    -.0043511    .0794722
finknowled~d |  -.0117804   .0209203    -0.56   0.574    -.0529752    .0294145
playertrad~e |   .0061413   .0472793     0.13   0.897    -.0869577    .0992403
playercour~l |  -.0547567    .052796    -1.04   0.301    -.1587189    .0492055
ingame_exp~e |  -.0244474    .041556    -0.59   0.557    -.1062765    .0573817
accuracy_p~o |   .1525378   .0764533     2.00   0.047     .0019913    .3030842
       _cons |   .3151753   .0616043     5.12   0.000     .1938684    .4364822
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe disp_effect  gamified `controls_2'  ingame_experience accuracy_pred_z
> ero if playerinner_name =="s2" & prediction_accuracy==1, absorb(round_number)
>  vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        412
Absorbing 1 HDFE group                            F(  10,    256) =       2.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0226
                                                  R-squared       =     0.1486
                                                  Adj R-squared   =     0.1208
                                                  Within R-sq.    =     0.0446
Number of clusters (participant_code) =        257Root MSE        =     0.4116

                     (Std. err. adjusted for 257 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
 disp_effect | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0526289   .0451354     1.17   0.245     -.036255    .1415129
     salient |   .0452677   .0413333     1.10   0.274    -.0361289    .1266642
     age_std |   -.014287   .0060506    -2.36   0.019    -.0262022   -.0023718
    d_gender |   .0202225   .0466881     0.43   0.665    -.0717192    .1121642
 finquiz_std |   .0841086   .0273328     3.08   0.002     .0302829    .1379344
finknowled~d |  -.0311895   .0260354    -1.20   0.232    -.0824603    .0200814
playertrad~e |   .0191627   .0528237     0.36   0.717    -.0848615     .123187
playercour~l |  -.0246144    .058112    -0.42   0.672    -.1390528     .089824
ingame_exp~e |  -.0236209   .0487088    -0.48   0.628    -.1195419    .0723001
accuracy_p~o |   .0900575   .0914303     0.98   0.326    -.0899939    .2701088
       _cons |   .2360156   .0768746     3.07   0.002     .0846284    .3874028
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. 
. reghdfe plr_alerts  gamified `controls'  ingame_experience accuracy_pred_zero
>  if playerinner_name =="s2" & prediction_accuracy<1, absorb(round_number) vce
> (cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        581
Absorbing 1 HDFE group                            F(  11,    294) =       1.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0361
                                                  R-squared       =     0.1086
                                                  Adj R-squared   =     0.0866
                                                  Within R-sq.    =     0.0775
Number of clusters (participant_code) =        295Root MSE        =     0.1635

                     (Std. err. adjusted for 295 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  plr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0090156    .009922    -0.91   0.364    -.0285427    .0105114
     salient |   -.025627   .0132411    -1.94   0.054    -.0516863    .0004322
     age_std |   .0028943   .0044662     0.65   0.517    -.0058954    .0116841
    d_gender |  -.0359204   .0212405    -1.69   0.092    -.0777231    .0058823
 finquiz_std |  -.0331439   .0120108    -2.76   0.006    -.0567819   -.0095059
finknowled~d |   .0130585   .0097078     1.35   0.180    -.0060472    .0321642
playertrad~e |   .0037003   .0275324     0.13   0.893    -.0504853    .0578859
playercour~l |  -.0467913   .0227491    -2.06   0.041     -.091563   -.0020196
prediction~d |  -.0331626   .0154106    -2.15   0.032    -.0634916   -.0028336
ingame_exp~e |   .0257788   .0176852     1.46   0.146    -.0090269    .0605844
accuracy_p~o |   .0590551   .0205377     2.88   0.004     .0186356    .0994745
       _cons |   .0331185   .0245819     1.35   0.179    -.0152604    .0814973
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe pgr_alerts  gamified `controls'  ingame_experience accuracy_pred_zero
>  if playerinner_name =="s2" & prediction_accuracy<1, absorb(round_number) vce
> (cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        536
Absorbing 1 HDFE group                            F(  11,    289) =       2.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0088
                                                  R-squared       =     0.0835
                                                  Adj R-squared   =     0.0589
                                                  Within R-sq.    =     0.0510
Number of clusters (participant_code) =        290Root MSE        =     0.3776

                     (Std. err. adjusted for 290 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  pgr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0806993   .0324716     2.49   0.014     .0167884    .1446102
     salient |   .0053979   .0334952     0.16   0.872    -.0605276    .0713234
     age_std |   .0058763   .0089284     0.66   0.511    -.0116967    .0234493
    d_gender |  -.0761688   .0385614    -1.98   0.049    -.1520655    -.000272
 finquiz_std |   .0172835   .0203898     0.85   0.397    -.0228478    .0574149
finknowled~d |   .0132752   .0191272     0.69   0.488    -.0243712    .0509215
playertrad~e |  -.0103582    .043614    -0.24   0.812    -.0961994    .0754831
playercour~l |  -.0792339   .0549777    -1.44   0.151    -.1874414    .0289736
prediction~d |  -.0076872   .0318525    -0.24   0.809    -.0703795    .0550051
ingame_exp~e |  -.1163281   .0371995    -3.13   0.002    -.1895444   -.0431117
accuracy_p~o |  -.0505491   .0658722    -0.77   0.443    -.1801991    .0791009
       _cons |   .5554997   .0546087    10.17   0.000     .4480185    .6629808
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. reghdfe disp_effect  gamified `controls'  ingame_experience accuracy_pred_zer
> o if playerinner_name =="s2" & prediction_accuracy<1, absorb(round_number) vc
> e(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        533
Absorbing 1 HDFE group                            F(  11,    287) =       2.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0011
                                                  R-squared       =     0.1165
                                                  Adj R-squared   =     0.0926
                                                  Within R-sq.    =     0.0651
Number of clusters (participant_code) =        288Root MSE        =     0.4085

                     (Std. err. adjusted for 288 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
 disp_effect | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0881344   .0345832     2.55   0.011     .0200655    .1562034
     salient |   .0283456   .0364665     0.78   0.438    -.0434301    .1001213
     age_std |   .0039557   .0074314     0.53   0.595    -.0106711    .0185826
    d_gender |  -.0374882   .0414221    -0.91   0.366    -.1190177    .0440414
 finquiz_std |   .0477045   .0204006     2.34   0.020     .0075507    .0878583
finknowled~d |  -.0041128   .0212647    -0.19   0.847    -.0459673    .0377416
playertrad~e |  -.0054807   .0494589    -0.11   0.912     -.102829    .0918676
playercour~l |  -.0295038   .0574593    -0.51   0.608    -.1425989    .0835914
prediction~d |    .029486   .0359002     0.82   0.412    -.0411751    .1001471
ingame_exp~e |  -.1487763   .0406495    -3.66   0.000    -.2287853   -.0687672
accuracy_p~o |  -.1119196   .0677012    -1.65   0.099    -.2451735    .0213342
       _cons |    .528927   .0619304     8.54   0.000     .4070316    .6508224
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\main_table_7.tex", adjr2 append tex tstat l
> abel  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\main_table_7.tex
dir : seeout

. 
. 
. 
. // Appendix Table F.1
. 
. gen rev=finquiz_std

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe excessive_trading gamified gamified_rev `controls' if playerinner_nam
> e =="s1", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(  10,    317) =       2.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0143
                                                  R-squared       =     0.0402
                                                  Adj R-squared   =     0.0283
                                                  Within R-sq.    =     0.0353
Number of clusters (participant_code) =        318Root MSE        =     0.4177

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0323724    .018573     1.74   0.082    -.0041696    .0689143
gamified_rev |   .0113733   .0220842     0.51   0.607    -.0320768    .0548234
     salient |  -.0122571   .0187373    -0.65   0.513    -.0491222     .024608
     age_std |  -.0093598   .0352205    -0.27   0.791    -.0786553    .0599357
    d_gender |  -.0322452   .0413049    -0.78   0.436    -.1135116    .0490212
 finquiz_std |   -.055899   .0268065    -2.09   0.038    -.1086403   -.0031578
finknowled~d |   .0318456   .0208297     1.53   0.127    -.0091363    .0728275
playertrad~e |   .1103117   .0463355     2.38   0.018     .0191478    .2014756
playercour~l |  -.0018777    .060548    -0.03   0.975    -.1210044     .117249
prediction~d |  -.0169262   .0138177    -1.22   0.221    -.0441121    .0102597
       _cons |   .5841112   .0376772    15.50   0.000     .5099822    .6582402
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F1.tex", adjr2 replace tex t
> stat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F1.tex
dir : seeout

. reghdfe excessive_trading gamified gamified_rev `controls' if playerinner_nam
> e =="s1" & playersr_prefs=="Design 2", absorb(round_number) vce(cl participan
> t_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        462
Absorbing 1 HDFE group                            F(  10,    139) =       2.54
Statistics robust to heteroskedasticity           Prob > F        =     0.0077
                                                  R-squared       =     0.0906
                                                  Adj R-squared   =     0.0642
                                                  Within R-sq.    =     0.0858
Number of clusters (participant_code) =        140Root MSE        =     0.4558

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0775971   .0297677     2.61   0.010     .0187411    .1364531
gamified_rev |   -.011657     .02819    -0.41   0.680    -.0673936    .0440796
     salient |  -.0180562   .0340371    -0.53   0.597    -.0853535    .0492411
     age_std |   .1087271    .065939     1.65   0.101     -.021646    .2391001
    d_gender |  -.0961357   .0721203    -1.33   0.185    -.2387304    .0464591
 finquiz_std |   -.108624   .0372727    -2.91   0.004    -.1823188   -.0349292
finknowled~d |   .0168835   .0356436     0.47   0.636    -.0535902    .0873572
playertrad~e |   .1393207   .0778636     1.79   0.076    -.0146295    .2932709
playercour~l |   .0942552   .0964304     0.98   0.330    -.0964049    .2849153
prediction~d |  -.0316582   .0245014    -1.29   0.198    -.0801018    .0167853
       _cons |    .644315   .0623413    10.34   0.000     .5210552    .7675748
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F1.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F1.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. gen rev=1-salient

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe excessive_trading gamified gamified_rev `controls' if playerinner_nam
> e =="s1", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(  10,    317) =       2.73
Statistics robust to heteroskedasticity           Prob > F        =     0.0031
                                                  R-squared       =     0.0415
                                                  Adj R-squared   =     0.0296
                                                  Within R-sq.    =     0.0366
Number of clusters (participant_code) =        318Root MSE        =     0.4174

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0010687   .0244384     0.04   0.965    -.0470132    .0491506
gamified_rev |   .0643434   .0346027     1.86   0.064    -.0037365    .1324234
     salient |   .0193523   .0250385     0.77   0.440    -.0299104     .068615
     age_std |  -.0090304   .0352349    -0.26   0.798    -.0783542    .0602934
    d_gender |   -.031866    .041307    -0.77   0.441    -.1131366    .0494046
 finquiz_std |  -.0499741   .0237133    -2.11   0.036    -.0966295   -.0033187
finknowled~d |   .0320904   .0208168     1.54   0.124    -.0088662    .0730471
playertrad~e |   .1098446   .0464175     2.37   0.019     .0185193      .20117
playercour~l |  -.0027231   .0604709    -0.05   0.964    -.1216982     .116252
prediction~d |  -.0164589   .0138294    -1.19   0.235    -.0436678    .0107501
       _cons |   .5679632   .0380734    14.92   0.000     .4930547    .6428717
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F1.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F1.tex
dir : seeout

. reghdfe excessive_trading gamified gamified_rev `controls' if playerinner_nam
> e =="s1" & playersr_prefs=="Design 2", absorb(round_number) vce(cl participan
> t_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        462
Absorbing 1 HDFE group                            F(  10,    139) =       2.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0082
                                                  R-squared       =     0.0905
                                                  Adj R-squared   =     0.0642
                                                  Within R-sq.    =     0.0857
Number of clusters (participant_code) =        140Root MSE        =     0.4558

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0870929   .0409631     2.13   0.035     .0061016    .1680842
gamified_rev |   -.016838   .0556347    -0.30   0.763    -.1268377    .0931616
     salient |  -.0264439    .042263    -0.63   0.533    -.1100054    .0571175
     age_std |   .1089063   .0658338     1.65   0.100    -.0212588    .2390715
    d_gender |  -.0965202   .0720937    -1.34   0.183    -.2390623    .0460219
 finquiz_std |  -.1145157   .0336724    -3.40   0.001    -.1810921   -.0479394
finknowled~d |    .016689   .0356978     0.47   0.641     -.053892      .08727
playertrad~e |    .139376   .0778991     1.79   0.076    -.0146444    .2933964
playercour~l |   .0949813   .0962691     0.99   0.326    -.0953598    .2853225
prediction~d |   -.031722   .0245278    -1.29   0.198    -.0802178    .0167738
       _cons |    .648006   .0618604    10.48   0.000     .5256971    .7703149
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F1.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F1.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. gen rev=ingame_experience

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe excessive_trading gamified gamified_rev `controls' if playerinner_nam
> e =="s1", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(  10,    317) =       2.28
Statistics robust to heteroskedasticity           Prob > F        =     0.0135
                                                  R-squared       =     0.0403
                                                  Adj R-squared   =     0.0284
                                                  Within R-sq.    =     0.0354
Number of clusters (participant_code) =        318Root MSE        =     0.4177

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0473122   .0432911     1.09   0.275     -.037862    .1324863
gamified_rev |  -.0293539   .0832349    -0.35   0.725    -.1931165    .1344087
     salient |  -.0123421   .0187539    -0.66   0.511    -.0492399    .0245556
     age_std |  -.0083713   .0347279    -0.24   0.810    -.0766976     .059955
    d_gender |  -.0316492    .041404    -0.76   0.445    -.1131106    .0498122
 finquiz_std |  -.0501358     .02369    -2.12   0.035    -.0967454   -.0035262
finknowled~d |   .0330732    .021379     1.55   0.123    -.0089895    .0751358
playertrad~e |   .1097887   .0465976     2.36   0.019     .0181091    .2014683
playercour~l |  -.0017422   .0605136    -0.03   0.977    -.1208012    .1173168
prediction~d |  -.0168659   .0138239    -1.22   0.223    -.0440641    .0103323
       _cons |     .58344   .0375715    15.53   0.000     .5095191     .657361
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F1.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F1.tex
dir : seeout

. reghdfe excessive_trading gamified gamified_rev `controls' if playerinner_nam
> e =="s1" & playersr_prefs=="Design 2", absorb(round_number) vce(cl participan
> t_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        462
Absorbing 1 HDFE group                            F(  10,    139) =       2.57
Statistics robust to heteroskedasticity           Prob > F        =     0.0070
                                                  R-squared       =     0.1019
                                                  Adj R-squared   =     0.0758
                                                  Within R-sq.    =     0.0971
Number of clusters (participant_code) =        140Root MSE        =     0.4529

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0217289   .0769932    -0.28   0.778     -.173958    .1305003
gamified_rev |    .212174   .1559522     1.36   0.176    -.0961713    .5205193
     salient |  -.0164854   .0339502    -0.49   0.628    -.0836111    .0506403
     age_std |   .0979604   .0626673     1.56   0.120    -.0259441    .2218649
    d_gender |  -.0858062   .0710132    -1.21   0.229    -.2262119    .0545995
 finquiz_std |   -.118637   .0343938    -3.45   0.001    -.1866396   -.0506343
finknowled~d |    .011778   .0350519     0.34   0.737    -.0575259     .081082
playertrad~e |   .1476867   .0797786     1.85   0.066    -.0100497    .3054232
playercour~l |    .085175   .0975468     0.87   0.384    -.1076925    .2780425
prediction~d |  -.0329657   .0242604    -1.36   0.176    -.0809328    .0150014
       _cons |   .6449093   .0624368    10.33   0.000     .5214607    .7683578
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F1.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F1.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. gen rev=accuracy_pred_zero
(28 missing values generated)

. gen gamified_rev=gamified*rev
(28 missing values generated)

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe excessive_trading gamified gamified_rev `controls' if playerinner_nam
> e =="s1", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,053
Absorbing 1 HDFE group                            F(  10,    317) =       2.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0072
                                                  R-squared       =     0.0414
                                                  Adj R-squared   =     0.0295
                                                  Within R-sq.    =     0.0370
Number of clusters (participant_code) =        318Root MSE        =     0.4166

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0289137   .0360789    -0.80   0.423     -.099898    .0420707
gamified_rev |   .1618389   .0819192     1.98   0.049     .0006649    .3230128
     salient |  -.0121149   .0192249    -0.63   0.529    -.0499394    .0257096
     age_std |  -.0128438   .0350581    -0.37   0.714    -.0818198    .0561323
    d_gender |   -.038994   .0411157    -0.95   0.344     -.119888    .0419001
 finquiz_std |  -.0425007   .0231781    -1.83   0.068     -.088103    .0031015
finknowled~d |    .031746   .0208655     1.52   0.129    -.0093063    .0727983
playertrad~e |   .1064986   .0460704     2.31   0.021     .0158563     .197141
playercour~l |  -.0092089   .0606833    -0.15   0.879    -.1286018     .110184
prediction~d |  -.0143965   .0140607    -1.02   0.307    -.0420606    .0132676
       _cons |   .5895359   .0373086    15.80   0.000     .5161321    .6629397
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F1.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F1.tex
dir : seeout

. reghdfe excessive_trading gamified gamified_rev `controls' if playerinner_nam
> e =="s1" & playersr_prefs=="Design 2", absorb(round_number) vce(cl participan
> t_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        461
Absorbing 1 HDFE group                            F(  10,    139) =       2.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0071
                                                  R-squared       =     0.0897
                                                  Adj R-squared   =     0.0632
                                                  Within R-sq.    =     0.0856
Number of clusters (participant_code) =        140Root MSE        =     0.4536

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0047195   .0714962     0.07   0.947    -.1366412    .1460803
gamified_rev |   .1811152   .1555487     1.16   0.246    -.1264324    .4886627
     salient |  -.0189034   .0350245    -0.54   0.590     -.088153    .0503463
     age_std |   .1066857   .0653511     1.63   0.105     -.022525    .2358964
    d_gender |  -.1066357   .0712538    -1.50   0.137    -.2475171    .0342456
 finquiz_std |  -.1074593   .0324829    -3.31   0.001    -.1716838   -.0432349
finknowled~d |    .016714   .0357112     0.47   0.640    -.0538933    .0873214
playertrad~e |   .1288556   .0760776     1.69   0.093    -.0215632    .2792745
playercour~l |   .0793117   .0968893     0.82   0.414    -.1122557    .2708792
prediction~d |   -.028537   .0247716    -1.15   0.251    -.0775147    .0204408
       _cons |   .6557089   .0611009    10.73   0.000     .5349017    .7765162
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F1.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F1.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. gen rev=overconfidence

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe excessive_trading gamified gamified_rev `controls' if playerinner_nam
> e =="s1", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(  10,    317) =       2.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0102
                                                  R-squared       =     0.0404
                                                  Adj R-squared   =     0.0285
                                                  Within R-sq.    =     0.0355
Number of clusters (participant_code) =        318Root MSE        =     0.4177

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0200879   .0316581     0.63   0.526    -.0421986    .0823745
gamified_rev |   -.059075   .0869252    -0.68   0.497    -.2300981    .1119482
     salient |  -.0121542   .0187123    -0.65   0.516    -.0489703    .0246618
     age_std |  -.0094795   .0352367    -0.27   0.788    -.0788068    .0598478
    d_gender |  -.0322445   .0413092    -0.78   0.436    -.1135194    .0490304
 finquiz_std |  -.0569119   .0264986    -2.15   0.032    -.1090473   -.0047766
finknowled~d |    .038474   .0236291     1.63   0.104    -.0080157    .0849636
playertrad~e |   .1103079   .0463382     2.38   0.018     .0191385    .2014772
playercour~l |  -.0017764   .0605201    -0.03   0.977    -.1208482    .1172955
prediction~d |  -.0173136    .013787    -1.26   0.210    -.0444392     .009812
       _cons |   .5837417   .0376341    15.51   0.000     .5096975     .657786
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F1.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F1.tex
dir : seeout

. reghdfe excessive_trading gamified gamified_rev `controls' if playerinner_nam
> e =="s1" & playersr_prefs=="Design 2", absorb(round_number) vce(cl participan
> t_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        462
Absorbing 1 HDFE group                            F(  10,    139) =       2.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0060
                                                  R-squared       =     0.0906
                                                  Adj R-squared   =     0.0642
                                                  Within R-sq.    =     0.0857
Number of clusters (participant_code) =        140Root MSE        =     0.4558

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
excessive_~g | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0856321    .041504     2.06   0.041     .0035712    .1676929
gamified_rev |   .0378746   .1099171     0.34   0.731     -.179451    .2552001
     salient |  -.0181709   .0340276    -0.53   0.594    -.0854494    .0491077
     age_std |   .1088078   .0659698     1.65   0.101    -.0216263    .2392418
    d_gender |  -.0961002   .0720679    -1.33   0.185    -.2385912    .0463907
 finquiz_std |  -.1101376   .0357981    -3.08   0.003    -.1809167   -.0393585
finknowled~d |   .0126023   .0385148     0.33   0.744    -.0635482    .0887529
playertrad~e |   .1392464   .0778675     1.79   0.076    -.0147114    .2932042
playercour~l |   .0943078   .0964584     0.98   0.330    -.0964077    .2850232
prediction~d |  -.0317452    .024492    -1.30   0.197    -.0801702    .0166798
       _cons |   .6445105   .0622743    10.35   0.000     .5213831    .7676379
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F1.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F1.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. // Appendix Table F.2 (top panel, buys)
. 
. gen rev=finquiz_std

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe bias_buy gamified gamified_rev `controls' if playerinner_name =="s1",
>  absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,046
Absorbing 1 HDFE group                            F(  10,    316) =       4.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0891
                                                  Adj R-squared   =     0.0776
                                                  Within R-sq.    =     0.0542
Number of clusters (participant_code) =        317Root MSE        =   247.2754

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   1.283812    14.1726     0.09   0.928    -26.60078     29.1684
gamified_rev |  -5.868238   14.72703    -0.40   0.691    -34.84366    23.10718
     salient |  -23.81027   11.50442    -2.07   0.039    -46.44521   -1.175329
     age_std |  -40.80663   18.81441    -2.17   0.031    -77.82397   -3.789298
    d_gender |  -22.95486   22.12205    -1.04   0.300    -66.47997    20.57025
 finquiz_std |  -39.30854   13.18186    -2.98   0.003    -65.24385   -13.37323
finknowled~d |   16.95082   11.85216     1.43   0.154      -6.3683    40.26994
playertrad~e |   68.60278   23.11542     2.97   0.003      23.1232    114.0824
playercour~l |  -54.23649   32.04222    -1.69   0.092    -117.2795    8.806554
prediction~d |   4.852099   7.886653     0.62   0.539    -10.66489    20.36909
       _cons |  -251.5111   23.26835   -10.81   0.000    -297.2915   -205.7306
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_buys.tex", adjr2 replace 
> tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_buys.tex
dir : seeout

. reghdfe bias_buy gamified gamified_rev `controls' if playerinner_name =="s1" 
> & playersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        458
Absorbing 1 HDFE group                            F(  10,    139) =       3.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0010
                                                  R-squared       =     0.1186
                                                  Adj R-squared   =     0.0928
                                                  Within R-sq.    =     0.0729
Number of clusters (participant_code) =        140Root MSE        =   232.1502

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   17.44164   19.69162     0.89   0.377    -21.49219    56.37547
gamified_rev |   1.802114   18.23207     0.10   0.921    -34.24593    37.85016
     salient |  -22.73812   17.93587    -1.27   0.207    -58.20052    12.72428
     age_std |   33.55557    26.7099     1.26   0.211    -19.25465    86.36579
    d_gender |  -53.89735   29.96407    -1.80   0.074    -113.1416    5.346951
 finquiz_std |  -58.97365   15.30657    -3.85   0.000    -89.23746   -28.70983
finknowled~d |  -2.115069   15.58823    -0.14   0.892    -32.93578    28.70564
playertrad~e |   90.14367   30.04724     3.00   0.003     30.73493    149.5524
playercour~l |   11.55773    42.1537     0.27   0.784    -71.78764    94.90309
prediction~d |   5.418052   9.900046     0.55   0.585     -14.1561     24.9922
       _cons |  -227.9199   31.66777    -7.20   0.000    -290.5327   -165.3071
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_buys.tex", adjr2 append t
> ex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_buys.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. gen rev=1-salient

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe bias_buy gamified gamified_rev `controls' if playerinner_name =="s1",
>  absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,046
Absorbing 1 HDFE group                            F(  10,    316) =       4.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0891
                                                  Adj R-squared   =     0.0777
                                                  Within R-sq.    =     0.0542
Number of clusters (participant_code) =        317Root MSE        =   247.2731

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   7.019648   17.56023     0.40   0.690     -27.5301    41.56939
gamified_rev |  -12.32326   24.40333    -0.50   0.614     -60.3368    35.69027
     salient |  -29.87147    17.2745    -1.73   0.085    -63.85904    4.116091
     age_std |  -40.83722   18.80149    -2.17   0.031    -77.82913     -3.8453
    d_gender |  -23.05559   22.12133    -1.04   0.298    -66.57929    20.46811
 finquiz_std |  -42.26295   10.95455    -3.86   0.000    -63.81603   -20.70988
finknowled~d |   16.89437   11.84652     1.43   0.155    -6.413661     40.2024
playertrad~e |    68.6476   23.09198     2.97   0.003     23.21415    114.0811
playercour~l |  -54.06608   32.02584    -1.69   0.092    -117.0769    8.944757
prediction~d |   4.742288   7.862621     0.60   0.547    -10.72741    20.21199
       _cons |  -248.2152   24.58163   -10.10   0.000    -296.5795   -199.8508
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_buys.tex", adjr2 append t
> ex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_buys.tex
dir : seeout

. reghdfe bias_buy gamified gamified_rev `controls' if playerinner_name =="s1" 
> & playersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        458
Absorbing 1 HDFE group                            F(  10,    139) =       4.29
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1244
                                                  Adj R-squared   =     0.0988
                                                  Within R-sq.    =     0.0790
Number of clusters (participant_code) =        140Root MSE        =   231.3836

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   55.01257   27.52251     2.00   0.048     .5956823    109.4295
gamified_rev |   -74.5809   35.46402    -2.10   0.037    -144.6996   -4.462244
     salient |  -58.84767   24.79039    -2.37   0.019    -107.8627    -9.83267
     age_std |   34.35685    26.6083     1.29   0.199    -18.25248    86.96618
    d_gender |  -54.79269   29.96377    -1.83   0.070    -114.0364    4.451014
 finquiz_std |  -58.74277   12.69349    -4.63   0.000    -83.84005   -33.64549
finknowled~d |  -2.539188   15.55687    -0.16   0.871    -33.29789    28.21951
playertrad~e |   90.75001   29.93614     3.03   0.003     31.56094    149.9391
playercour~l |   13.37855   42.13607     0.32   0.751    -69.93195    96.68905
prediction~d |   5.262112   9.898785     0.53   0.596    -14.30954    24.83377
       _cons |  -210.0066   32.89902    -6.38   0.000    -275.0538   -144.9594
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_buys.tex", adjr2 append t
> ex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_buys.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. gen rev=ingame_experience

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe bias_buy gamified gamified_rev `controls' if playerinner_name =="s1",
>  absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,046
Absorbing 1 HDFE group                            F(  10,    316) =       4.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0901
                                                  Adj R-squared   =     0.0786
                                                  Within R-sq.    =     0.0552
Number of clusters (participant_code) =        317Root MSE        =   247.1443

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   17.97686   26.00638     0.69   0.490    -33.19068     69.1444
gamified_rev |   -34.6584   42.96283    -0.81   0.420    -119.1877    49.87094
     salient |  -24.06951   11.56527    -2.08   0.038    -46.82416   -1.314848
     age_std |  -39.59276   18.77261    -2.11   0.036    -76.52786   -2.657668
    d_gender |  -22.45653   22.03249    -1.02   0.309    -65.80545    20.89238
 finquiz_std |  -42.03859   10.96377    -3.83   0.000    -63.60981   -20.46737
finknowled~d |   18.42776   11.87366     1.55   0.122    -4.933662    41.78919
playertrad~e |   67.80545   23.10572     2.93   0.004     22.34495     113.266
playercour~l |  -54.14772   32.04048    -1.69   0.092    -117.1873    8.891901
prediction~d |   4.792148   7.859627     0.61   0.542    -10.67166    20.25596
       _cons |     -251.3   23.16917   -10.85   0.000    -296.8853   -205.7147
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_buys.tex", adjr2 append t
> ex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_buys.tex
dir : seeout

. reghdfe bias_buy gamified gamified_rev `controls' if playerinner_name =="s1" 
> & playersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        458
Absorbing 1 HDFE group                            F(  10,    139) =       3.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0007
                                                  R-squared       =     0.1197
                                                  Adj R-squared   =     0.0939
                                                  Within R-sq.    =     0.0740
Number of clusters (participant_code) =        140Root MSE        =   232.0083

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   33.55433   36.87103     0.91   0.364    -39.34624    106.4549
gamified_rev |  -34.00123    62.2806    -0.55   0.586     -157.141    89.13859
     salient |  -22.92354   18.02194    -1.27   0.206    -58.55611    12.70903
     age_std |   35.24131   27.17887     1.30   0.197    -18.49614    88.97877
    d_gender |   -55.4499   30.41745    -1.82   0.070    -115.5906    4.690799
 finquiz_std |   -57.3611   13.00221    -4.41   0.000    -83.06878   -31.65341
finknowled~d |  -1.277289    15.2895    -0.08   0.934    -31.50734    28.95276
playertrad~e |   88.80618   30.28469     2.93   0.004     28.92796    148.6844
playercour~l |   13.06737   42.54737     0.31   0.759    -71.05635    97.19108
prediction~d |   5.622817   9.904718     0.57   0.571    -13.96057     25.2062
       _cons |  -228.1994   31.43974    -7.26   0.000    -290.3613   -166.0374
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_buys.tex", adjr2 append t
> ex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_buys.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. 
. gen rev=accuracy_pred_zero
(28 missing values generated)

. gen gamified_rev=gamified*rev
(28 missing values generated)

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe bias_buy gamified gamified_rev `controls' if playerinner_name =="s1",
>  absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,036
Absorbing 1 HDFE group                            F(  10,    316) =       4.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0940
                                                  Adj R-squared   =     0.0825
                                                  Within R-sq.    =     0.0582
Number of clusters (participant_code) =        317Root MSE        =   246.5814

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   -39.9701   22.14269    -1.81   0.072    -83.53584    3.595637
gamified_rev |    104.375    44.2796     2.36   0.019     17.25495    191.4951
     salient |   -23.5588   11.68216    -2.02   0.045    -46.54344   -.5741675
     age_std |  -44.24071   18.69709    -2.37   0.019    -81.02723   -7.454202
    d_gender |  -24.95304   22.07789    -1.13   0.259    -68.39126    18.48519
 finquiz_std |  -37.89383   10.81331    -3.50   0.001    -59.16902   -16.61865
finknowled~d |   17.90723   11.84756     1.51   0.132    -5.402843    41.21729
playertrad~e |   65.79921   22.76656     2.89   0.004     21.00602    110.5924
playercour~l |  -60.09721   32.61182    -1.84   0.066    -124.2609    4.066527
prediction~d |   5.190173   7.976133     0.65   0.516    -10.50286    20.88321
       _cons |  -247.2166   22.84251   -10.82   0.000    -292.1592    -202.274
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_buys.tex", adjr2 append t
> ex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_buys.tex
dir : seeout

. reghdfe bias_buy gamified gamified_rev `controls' if playerinner_name =="s1" 
> & playersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        457
Absorbing 1 HDFE group                            F(  10,    139) =       3.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0007
                                                  R-squared       =     0.1213
                                                  Adj R-squared   =     0.0955
                                                  Within R-sq.    =     0.0758
Number of clusters (participant_code) =        140Root MSE        =   231.9427

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   -21.4131   36.07229    -0.59   0.554    -92.73442    49.90822
gamified_rev |   91.96856   71.34133     1.29   0.199    -49.08593     233.023
     salient |  -20.98603   18.15098    -1.16   0.250    -56.87375    14.90168
     age_std |   31.43661   26.81252     1.17   0.243    -21.57651    84.44973
    d_gender |  -56.34548   30.10812    -1.87   0.063    -115.8746    3.183623
 finquiz_std |  -56.69832   12.93639    -4.38   0.000    -82.27586   -31.12078
finknowled~d |  -2.418526   15.54987    -0.16   0.877    -33.16339    28.32633
playertrad~e |   87.93581   29.88414     2.94   0.004     28.84954    147.0221
playercour~l |   8.895344   43.18255     0.21   0.837    -76.48423    94.27492
prediction~d |   5.837183   9.962484     0.59   0.559    -13.86042    25.53479
       _cons |  -225.8345   31.71966    -7.12   0.000    -288.5499   -163.1191
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_buys.tex", adjr2 append t
> ex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_buys.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. gen rev=overconfidence

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe bias_buy gamified gamified_rev `controls' if playerinner_name =="s1",
>  absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,046
Absorbing 1 HDFE group                            F(  10,    316) =       4.38
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0895
                                                  Adj R-squared   =     0.0780
                                                  Within R-sq.    =     0.0546
Number of clusters (participant_code) =        317Root MSE        =   247.2201

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   10.66186   19.54804     0.55   0.586    -27.79891    49.12262
gamified_rev |   44.44074   52.44621     0.85   0.397    -58.74715    147.6286
     salient |  -23.82271   11.51317    -2.07   0.039    -46.47488   -1.170546
     age_std |  -40.71477   18.81111    -2.16   0.031    -77.72563   -3.703913
    d_gender |    -22.977   22.12677    -1.04   0.300    -66.51141    20.55742
 finquiz_std |  -37.25987   12.35012    -3.02   0.003    -61.55873   -12.96101
finknowled~d |   11.96769   13.59368     0.88   0.379    -14.77787    38.71324
playertrad~e |   68.63343   23.12501     2.97   0.003     23.13498    114.1319
playercour~l |   -54.2951   32.05888    -1.69   0.091    -117.3709    8.780734
prediction~d |   5.153122   7.912077     0.65   0.515    -10.41388    20.72013
       _cons |  -251.3576   23.27745   -10.80   0.000     -297.156   -205.5592
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_buys.tex", adjr2 append t
> ex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_buys.tex
dir : seeout

. reghdfe bias_buy gamified gamified_rev `controls' if playerinner_name =="s1" 
> & playersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        458
Absorbing 1 HDFE group                            F(  10,    139) =       3.17
Statistics robust to heteroskedasticity           Prob > F        =     0.0011
                                                  R-squared       =     0.1193
                                                  Adj R-squared   =     0.0935
                                                  Within R-sq.    =     0.0737
Number of clusters (participant_code) =        140Root MSE        =   232.0562

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
    bias_buy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   26.19071    25.1829     1.04   0.300    -23.60036    75.98178
gamified_rev |   48.03832   71.28161     0.67   0.501    -92.89808    188.9747
     salient |  -22.51827   17.93438    -1.26   0.211    -57.97772    12.94118
     age_std |   33.63421   26.75805     1.26   0.211    -19.27121    86.53964
    d_gender |  -53.74862   29.99025    -1.79   0.075    -113.0447    5.547424
 finquiz_std |  -52.78731   14.08642    -3.75   0.000    -80.63868   -24.93595
finknowled~d |  -7.372442   17.37233    -0.42   0.672    -41.72063    26.97574
playertrad~e |   90.20561   30.08027     3.00   0.003     30.73157    149.6796
playercour~l |   11.20879   42.23027     0.27   0.791    -72.28796    94.70554
prediction~d |   5.343277     9.8556     0.54   0.589      -14.143    24.82955
       _cons |  -227.1886   31.70257    -7.17   0.000    -289.8702    -164.507
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_buys.tex", adjr2 append t
> ex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_buys.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. 
. // Appendix Table F.2 (bottom panel, sells)
. 
. gen rev=finquiz_std

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe bias_sell gamified gamified_rev `controls' if playerinner_name =="s1"
> , absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(  10,    317) =       2.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0245
                                                  R-squared       =     0.0785
                                                  Adj R-squared   =     0.0670
                                                  Within R-sq.    =     0.0306
Number of clusters (participant_code) =        318Root MSE        =   233.6261

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -16.32038   11.95551    -1.37   0.173    -39.84256      7.2018
gamified_rev |   8.435824   13.08394     0.64   0.520    -17.30651    34.17816
     salient |  -4.668226   12.00819    -0.39   0.698    -28.29405     18.9576
     age_std |   13.12785   18.35284     0.72   0.475    -22.98092    49.23663
    d_gender |   .2848484   20.66631     0.01   0.989    -40.37562    40.94532
 finquiz_std |   23.08767   13.04793     1.77   0.078    -2.583814    48.75916
finknowled~d |  -21.72755   12.35522    -1.76   0.080    -46.03616    2.581048
playertrad~e |  -54.77206   21.16113    -2.59   0.010    -96.40607   -13.13805
playercour~l |   36.21902   31.71386     1.14   0.254    -26.17722    98.61526
prediction~d |   4.098343    7.97463     0.51   0.608    -11.59155    19.78823
       _cons |   287.0067   21.01941    13.65   0.000     245.6515    328.3619
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_sells.tex", adjr2 replace
>  tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_sells.tex
dir : seeout

. reghdfe bias_sell gamified gamified_rev `controls' if playerinner_name =="s1"
>  & playersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        462
Absorbing 1 HDFE group                            F(  10,    139) =       2.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0061
                                                  R-squared       =     0.1291
                                                  Adj R-squared   =     0.1039
                                                  Within R-sq.    =     0.0823
Number of clusters (participant_code) =        140Root MSE        =   217.1226

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   -39.4011   16.73947    -2.35   0.020    -72.49801   -6.304194
gamified_rev |  -11.88422   15.84418    -0.75   0.454    -43.21097    19.44254
     salient |  -6.378725   17.40748    -0.37   0.715     -40.7964    28.03895
     age_std |  -52.94515   31.00933    -1.71   0.090    -114.2561    8.365808
    d_gender |   41.97627   31.66828     1.33   0.187    -20.63754    104.5901
 finquiz_std |   60.86536   17.39885     3.50   0.001     26.46473    95.26598
finknowled~d |  -8.659876    17.8445    -0.49   0.628    -43.94162    26.62187
playertrad~e |  -63.12771    28.3655    -2.23   0.028    -119.2113   -7.044083
playercour~l |  -6.842882   44.04253    -0.16   0.877    -93.92279    80.23702
prediction~d |   18.94725   10.61903     1.78   0.077    -2.048468    39.94297
       _cons |   265.3218    31.2676     8.49   0.000     203.5002    327.1434
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_sells.tex", adjr2 append 
> tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_sells.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. gen rev=1-salient

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe bias_sell gamified gamified_rev `controls' if playerinner_name =="s1"
> , absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(  10,    317) =       2.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0158
                                                  R-squared       =     0.0788
                                                  Adj R-squared   =     0.0674
                                                  Within R-sq.    =     0.0309
Number of clusters (participant_code) =        318Root MSE        =   233.5824

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -3.648838   16.59258    -0.22   0.826    -36.29433    28.99666
gamified_rev |  -24.55833   21.52695    -1.14   0.255    -66.91208    17.79543
     salient |  -16.58014   15.30657    -1.08   0.280    -46.69544    13.53516
     age_std |   12.99926   18.35515     0.71   0.479    -23.11405    49.11257
    d_gender |   .2444445   20.64602     0.01   0.991     -40.3761    40.86499
 finquiz_std |   27.17339   10.85718     2.50   0.013     5.812156    48.53463
finknowled~d |  -21.84946   12.35603    -1.77   0.078    -46.15964    2.460721
playertrad~e |  -54.44865   21.14177    -2.58   0.010    -96.04458   -12.85273
playercour~l |   36.61486   31.72106     1.15   0.249    -25.79555    99.02527
prediction~d |    4.00001   7.964295     0.50   0.616    -11.66955    19.66957
       _cons |   292.4951   21.48187    13.62   0.000       250.23    334.7601
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_sells.tex", adjr2 append 
> tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_sells.tex
dir : seeout

. reghdfe bias_sell gamified gamified_rev `controls' if playerinner_name =="s1"
>  & playersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        462
Absorbing 1 HDFE group                            F(  10,    139) =       2.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0052
                                                  R-squared       =     0.1286
                                                  Adj R-squared   =     0.1033
                                                  Within R-sq.    =     0.0817
Number of clusters (participant_code) =        140Root MSE        =   217.1885

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -31.73938   23.99195    -1.32   0.188    -79.17572    15.69696
gamified_rev |  -13.17801    29.9129    -0.44   0.660    -72.32113    45.96512
     salient |   -13.0061   23.35365    -0.56   0.578    -59.18041    33.16822
     age_std |  -52.79793   31.03085    -1.70   0.091    -114.1514    8.555576
    d_gender |   41.63959   31.66207     1.32   0.191    -20.96194    104.2411
 finquiz_std |   54.89432   14.90067     3.68   0.000     25.43305     84.3556
finknowled~d |  -8.834944   17.85009    -0.49   0.621    -44.12774    26.45785
playertrad~e |  -63.09995   28.35574    -2.23   0.028    -119.1643   -7.035612
playercour~l |  -6.205264   44.12084    -0.14   0.888       -93.44    81.02947
prediction~d |   18.88894   10.58155     1.79   0.076    -2.032656    39.81054
       _cons |   268.1347   31.44496     8.53   0.000     205.9625     330.307
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_sells.tex", adjr2 append 
> tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_sells.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. gen rev=ingame_experience

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe bias_sell gamified gamified_rev `controls' if playerinner_name =="s1"
> , absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(  10,    317) =       2.14
Statistics robust to heteroskedasticity           Prob > F        =     0.0216
                                                  R-squared       =     0.0797
                                                  Adj R-squared   =     0.0682
                                                  Within R-sq.    =     0.0318
Number of clusters (participant_code) =        318Root MSE        =   233.4750

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -34.35851     24.206    -1.42   0.157    -81.98322    13.26621
gamified_rev |   38.01981   41.46034     0.92   0.360     -43.5524     119.592
     salient |  -4.281326   12.05573    -0.36   0.723    -28.00068    19.43803
     age_std |   11.84238   18.31282     0.65   0.518    -24.18765     47.8724
    d_gender |  -.2979323   20.45386    -0.01   0.988    -40.54041    39.94454
 finquiz_std |   27.13161   10.79779     2.51   0.012      5.88722    48.37601
finknowled~d |  -23.36915   12.59593    -1.86   0.064    -48.15133    1.413023
playertrad~e |  -53.83146    21.0568    -2.56   0.011    -95.26021   -12.40271
playercour~l |   36.17616   31.69808     1.14   0.255    -26.18904    98.54136
prediction~d |   4.165336   7.962837     0.52   0.601    -11.50135    19.83202
       _cons |   286.6523   20.89152    13.72   0.000     245.5487    327.7558
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_sells.tex", adjr2 append 
> tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_sells.tex
dir : seeout

. reghdfe bias_sell gamified gamified_rev `controls' if playerinner_name =="s1"
>  & playersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        462
Absorbing 1 HDFE group                            F(  10,    139) =       2.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0060
                                                  R-squared       =     0.1288
                                                  Adj R-squared   =     0.1035
                                                  Within R-sq.    =     0.0819
Number of clusters (participant_code) =        140Root MSE        =   217.1636

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -47.61534   33.81426    -1.41   0.161    -114.4721    19.24146
gamified_rev |   19.47142   58.64399     0.33   0.740    -96.47817     135.421
     salient |  -6.480737   17.38436    -0.37   0.710     -40.8527    27.89122
     age_std |  -53.90611   31.09823    -1.73   0.085    -115.3928    7.580618
    d_gender |   42.78435    32.5684     1.31   0.191    -21.60917    107.1779
 finquiz_std |   54.61973   14.94529     3.65   0.000     25.07024    84.16923
finknowled~d |  -9.217988   17.94189    -0.51   0.608    -44.69229    26.25631
playertrad~e |  -62.42069   28.51207    -2.19   0.030    -118.7941    -6.04726
playercour~l |  -7.404571   44.08977    -0.17   0.867    -94.57787    79.76873
prediction~d |   18.79427   10.64161     1.77   0.080    -2.246094    39.83463
       _cons |   265.0796   31.27249     8.48   0.000     203.2483    326.9109
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_sells.tex", adjr2 append 
> tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_sells.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. 
. gen rev=accuracy_pred_zero
(28 missing values generated)

. gen gamified_rev=gamified*rev
(28 missing values generated)

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe bias_sell gamified gamified_rev `controls' if playerinner_name =="s1"
> , absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,053
Absorbing 1 HDFE group                            F(  10,    317) =       2.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0062
                                                  R-squared       =     0.0812
                                                  Adj R-squared   =     0.0697
                                                  Within R-sq.    =     0.0329
Number of clusters (participant_code) =        318Root MSE        =   233.3583

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   17.78333   20.71771     0.86   0.391    -22.97826    58.54492
gamified_rev |  -82.57051   43.13847    -1.91   0.057    -167.4444    2.303376
     salient |  -3.593595   12.12837    -0.30   0.767    -27.45588    20.26869
     age_std |   15.98141   18.27182     0.87   0.382    -19.96795    51.93077
    d_gender |   3.143712   20.58567     0.15   0.879     -37.3581    43.64552
 finquiz_std |   24.22581   10.92032     2.22   0.027     2.740348    45.71127
finknowled~d |   -22.5282    12.3631    -1.82   0.069    -46.85229    1.795895
playertrad~e |   -52.3326    21.0154    -2.49   0.013    -93.67989   -10.98532
playercour~l |   44.21741   32.07019     1.38   0.169    -18.87991    107.3147
prediction~d |   3.788896   8.053852     0.47   0.638    -12.05686    19.63465
       _cons |   281.5189   20.85785    13.50   0.000     240.4816    322.5562
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_sells.tex", adjr2 append 
> tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_sells.tex
dir : seeout

. reghdfe bias_sell gamified gamified_rev `controls' if playerinner_name =="s1"
>  & playersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        461
Absorbing 1 HDFE group                            F(  10,    139) =       2.80
Statistics robust to heteroskedasticity           Prob > F        =     0.0035
                                                  R-squared       =     0.1302
                                                  Adj R-squared   =     0.1049
                                                  Within R-sq.    =     0.0833
Number of clusters (participant_code) =        140Root MSE        =   217.1416

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -7.527319   35.23927    -0.21   0.831    -77.20162    62.14699
gamified_rev |  -73.26645   70.28509    -1.04   0.299    -212.2326    65.69967
     salient |  -7.963645   17.51673    -0.45   0.650    -42.59734    26.67005
     age_std |  -51.28403    30.8338    -1.66   0.099    -112.2479    9.679864
    d_gender |   43.76186   31.60592     1.38   0.168    -18.72865    106.2524
 finquiz_std |   53.98407   14.99999     3.60   0.000     24.32642    83.64171
finknowled~d |   -8.53407     17.706    -0.48   0.631    -43.54198    26.47384
playertrad~e |  -61.52018   28.39618    -2.17   0.032    -117.6645   -5.375892
playercour~l |  -4.532085   44.88436    -0.10   0.920    -93.27645    84.21228
prediction~d |   18.63718   10.62769     1.75   0.082     -2.37565       39.65
       _cons |   263.4229   31.57919     8.34   0.000     200.9852    325.8606
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_sells.tex", adjr2 append 
> tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_sells.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. gen rev=overconfidence

. gen gamified_rev=gamified*rev

. label variable gamified_rev "Gamified $\times$ REV"

. reghdfe bias_sell gamified gamified_rev `controls' if playerinner_name =="s1"
> , absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,063
Absorbing 1 HDFE group                            F(  10,    317) =       2.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0154
                                                  R-squared       =     0.0791
                                                  Adj R-squared   =     0.0677
                                                  Within R-sq.    =     0.0312
Number of clusters (participant_code) =        318Root MSE        =   233.5428

                     (Std. err. adjusted for 318 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -28.07564   16.24381    -1.73   0.085    -60.03494    3.883663
gamified_rev |  -55.89672   47.92012    -1.17   0.244    -150.1784    38.38496
     salient |  -4.598668   11.99974    -0.38   0.702    -28.20787    19.01053
     age_std |   13.01511   18.33908     0.71   0.478    -23.06659     49.0968
    d_gender |   .2665833   20.66394     0.01   0.990    -40.38921    40.92237
 finquiz_std |   20.97398   12.28387     1.71   0.089    -3.194238     45.1422
finknowled~d |  -15.45062   13.52829    -1.14   0.254     -42.0672    11.16596
playertrad~e |  -54.80211   21.15924    -2.59   0.010     -96.4324   -13.17182
playercour~l |   36.30158   31.72719     1.14   0.253     -26.1209    98.72406
prediction~d |   3.717164    8.01806     0.46   0.643    -12.05817     19.4925
       _cons |   286.7799   20.99479    13.66   0.000     245.4732    328.0867
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_sells.tex", adjr2 append 
> tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_sells.tex
dir : seeout

. reghdfe bias_sell gamified gamified_rev `controls' if playerinner_name =="s1"
>  & playersr_prefs=="Design 2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        462
Absorbing 1 HDFE group                            F(  10,    139) =       2.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0055
                                                  R-squared       =     0.1284
                                                  Adj R-squared   =     0.1032
                                                  Within R-sq.    =     0.0815
Number of clusters (participant_code) =        140Root MSE        =   217.2096

                     (Std. err. adjusted for 140 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
   bias_sell | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -36.55185   22.36805    -1.63   0.104    -80.77745    7.673753
gamified_rev |   9.968294   75.80866     0.13   0.896    -139.9189    159.8555
     salient |  -6.609591   17.40493    -0.38   0.705    -41.02222    27.80304
     age_std |  -52.90182   31.05132    -1.70   0.091    -114.2958     8.49216
    d_gender |   41.87158   31.72563     1.32   0.189    -20.85563    104.5988
 finquiz_std |   56.12452   17.70281     3.17   0.002     21.12291    91.12612
finknowled~d |  -9.859672   19.90059    -0.50   0.621    -49.20667    29.48733
playertrad~e |  -63.19678   28.34735    -2.23   0.027    -119.2445   -7.149027
playercour~l |   -6.60763    44.0097    -0.15   0.881    -93.62262    80.40736
prediction~d |   18.89747   10.58288     1.79   0.076    -2.026767    39.82171
       _cons |   265.1313   31.24688     8.49   0.000     203.3507     326.912
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F2_sells.tex", adjr2 append 
> tex tstat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F2_sells.tex
dir : seeout

. drop rev

. drop gamified_rev

. 
. 
. // Appendix Table F.3
.  
. reghdfe prediction_accuracy gamified `controls_2'  ingame_experience accuracy
> _pred_zero if playerinner_name =="s2", absorb(round_number) vce(cl participan
> t_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,058
Absorbing 1 HDFE group                            F(  10,    316) =       1.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0477
                                                  R-squared       =     0.2657
                                                  Adj R-squared   =     0.2565
                                                  Within R-sq.    =     0.0154
Number of clusters (participant_code) =        317Root MSE        =     0.2132

                     (Std. err. adjusted for 317 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0104785   .0138398     0.76   0.450    -.0167513    .0377083
     salient |   .0197958   .0151029     1.31   0.191    -.0099192    .0495108
     age_std |   .0019313   .0022625     0.85   0.394    -.0025202    .0063828
    d_gender |   .0380639   .0130601     2.91   0.004     .0123681    .0637597
 finquiz_std |   .0025534   .0065186     0.39   0.696    -.0102718    .0153787
finknowled~d |  -.0024509   .0082403    -0.30   0.766    -.0186637    .0137619
playertrad~e |  -.0163817   .0150475    -1.09   0.277    -.0459878    .0132243
playercour~l |   .0093722   .0183017     0.51   0.609    -.0266363    .0453807
ingame_exp~e |  -.0166132   .0122127    -1.36   0.175    -.0406417    .0074152
accuracy_p~o |  -.0243265   .0257128    -0.95   0.345    -.0749165    .0262634
       _cons |   .7363102   .0195217    37.72   0.000     .6979012    .7747193
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F3.tex", adjr2 replace tex t
> stat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F3.tex
dir : seeout

. reghdfe prediction_accuracy  gamified `controls_2'   ingame_experience accura
> cy_pred_zero if playerinner_name =="s2" & prediction_accuracy_std<=0, absorb(
> round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        452
Absorbing 1 HDFE group                            F(  10,    275) =       1.36
Statistics robust to heteroskedasticity           Prob > F        =     0.1995
                                                  R-squared       =     0.0475
                                                  Adj R-squared   =     0.0192
                                                  Within R-sq.    =     0.0301
Number of clusters (participant_code) =        276Root MSE        =     0.0671

                     (Std. err. adjusted for 276 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0105199   .0056112    -1.87   0.062    -.0215662    .0005264
     salient |  -.0053891    .007209    -0.75   0.455     -.019581    .0088028
     age_std |    .002125   .0012741     1.67   0.096    -.0003833    .0046333
    d_gender |   .0071496   .0078297     0.91   0.362    -.0082641    .0225634
 finquiz_std |  -.0015007   .0029209    -0.51   0.608    -.0072509    .0042495
finknowled~d |   .0012361   .0049944     0.25   0.805    -.0085961    .0110682
playertrad~e |   .0010191   .0081156     0.13   0.900    -.0149574    .0169957
playercour~l |  -.0091364   .0127738    -0.72   0.475    -.0342834    .0160105
ingame_exp~e |  -.0015146    .006186    -0.24   0.807    -.0136927    .0106634
accuracy_p~o |  -.0308506    .012921    -2.39   0.018    -.0562872    -.005414
       _cons |   .4982555   .0093437    53.33   0.000     .4798613    .5166497
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F3.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F3.tex
dir : seeout

. reghdfe prediction_accuracy  gamified `controls_2'  ingame_experience accurac
> y_pred_zero if playerinner_name =="s2" &  & prediction_accuracy_std>0, absorb
> (round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        606
Absorbing 1 HDFE group                            F(  10,    301) =       2.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0052
                                                  R-squared       =     0.0973
                                                  Adj R-squared   =     0.0774
                                                  Within R-sq.    =     0.0660
Number of clusters (participant_code) =        302Root MSE        =     0.0992

                     (Std. err. adjusted for 302 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0104015   .0081147     1.28   0.201    -.0055672    .0263701
     salient |   .0074106   .0076783     0.97   0.335    -.0076992    .0225205
     age_std |   .0018621   .0014674     1.27   0.205    -.0010256    .0047498
    d_gender |    .026095   .0098817     2.64   0.009     .0066491     .045541
 finquiz_std |     .00585   .0056475     1.04   0.301    -.0052636    .0169637
finknowled~d |  -.0014362   .0052296    -0.27   0.784    -.0117275    .0088551
playertrad~e |  -.0074525   .0116612    -0.64   0.523    -.0304004    .0154953
playercour~l |  -.0013402   .0128911    -0.10   0.917    -.0267082    .0240278
ingame_exp~e |  -.0338258      .0096    -3.52   0.000    -.0527174   -.0149342
accuracy_p~o |   .0443022   .0199506     2.22   0.027     .0050418    .0835626
       _cons |   .9262256   .0140237    66.05   0.000     .8986287    .9538226
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F3.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F3.tex
dir : seeout

. 
. reghdfe prediction_accuracy  gamified `controls_2'  ingame_experience accurac
> y_pred_zero if playerinner_name =="s2" [pweight=prediction_confidence], absor
> b(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,027
Absorbing 1 HDFE group                            F(  10,    314) =       1.69
Statistics robust to heteroskedasticity           Prob > F        =     0.0818
                                                  R-squared       =     0.2927
                                                  Adj R-squared   =     0.2836
                                                  Within R-sq.    =     0.0158
Number of clusters (participant_code) =        315Root MSE        =     0.2140

                     (Std. err. adjusted for 315 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0088219   .0149367     0.59   0.555    -.0205668    .0382105
     salient |    .018386   .0168169     1.09   0.275     -.014702     .051474
     age_std |   .0007629   .0019033     0.40   0.689    -.0029819    .0045077
    d_gender |   .0384449   .0139251     2.76   0.006     .0110465    .0658433
 finquiz_std |   .0001589   .0069294     0.02   0.982    -.0134749    .0137928
finknowled~d |  -.0048513   .0085214    -0.57   0.570    -.0216176    .0119149
playertrad~e |  -.0093598   .0154648    -0.61   0.545    -.0397876     .021068
playercour~l |   .0016335   .0189756     0.09   0.931    -.0357019     .038969
ingame_exp~e |  -.0189796   .0129569    -1.46   0.144     -.044473    .0065138
accuracy_p~o |  -.0228112    .028087    -0.81   0.417    -.0780737    .0324512
       _cons |   .7230367   .0220199    32.84   0.000     .6797114     .766362
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F3.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F3.tex
dir : seeout

. reghdfe prediction_accuracy  gamified `controls_2'  ingame_experience accurac
> y_pred_zero if playerinner_name =="s2" &  & prediction_accuracy_std<=0 [pweig
> ht=prediction_confidence], absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        446
Absorbing 1 HDFE group                            F(  10,    274) =       1.60
Statistics robust to heteroskedasticity           Prob > F        =     0.1071
                                                  R-squared       =     0.0748
                                                  Adj R-squared   =     0.0470
                                                  Within R-sq.    =     0.0485
Number of clusters (participant_code) =        275Root MSE        =     0.0776

                     (Std. err. adjusted for 275 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0153848   .0075156    -2.05   0.042    -.0301804   -.0005892
     salient |  -.0051775   .0097957    -0.53   0.598    -.0244618    .0141069
     age_std |   .0025888   .0014061     1.84   0.067    -.0001793    .0053569
    d_gender |   .0152901   .0098151     1.56   0.120    -.0040326    .0346128
 finquiz_std |  -.0015252   .0041155    -0.37   0.711    -.0096273    .0065769
finknowled~d |   .0033614   .0064517     0.52   0.603    -.0093398    .0160626
playertrad~e |   .0028391   .0103372     0.27   0.784    -.0175113    .0231895
playercour~l |  -.0082684   .0153864    -0.54   0.591     -.038559    .0220223
ingame_exp~e |  -.0046637   .0079326    -0.59   0.557    -.0202804     .010953
accuracy_p~o |  -.0440356   .0169762    -2.59   0.010    -.0774559   -.0106153
       _cons |   .4945578   .0127395    38.82   0.000      .469478    .5196376
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F3.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F3.tex
dir : seeout

. reghdfe prediction_accuracy  gamified `controls_2'  ingame_experience accurac
> y_pred_zero if playerinner_name =="s2" &  & prediction_accuracy_std>0 [pweigh
> t=prediction_confidence], absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        581
Absorbing 1 HDFE group                            F(  10,    298) =       3.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.1084
                                                  Adj R-squared   =     0.0880
                                                  Within R-sq.    =     0.0904
Number of clusters (participant_code) =        299Root MSE        =     0.1003

                     (Std. err. adjusted for 299 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0204022    .009065     2.25   0.025     .0025627    .0382417
     salient |   .0084279   .0092252     0.91   0.362    -.0097269    .0265826
     age_std |   .0024813   .0015682     1.58   0.115    -.0006048    .0055674
    d_gender |   .0283082   .0113177     2.50   0.013     .0060354    .0505809
 finquiz_std |   .0059847   .0056762     1.05   0.293    -.0051857    .0171552
finknowled~d |  -.0031189    .005838    -0.53   0.594    -.0146078    .0083701
playertrad~e |  -.0055179    .012056    -0.46   0.648    -.0292435    .0182078
playercour~l |  -.0086566   .0144292    -0.60   0.549    -.0370526    .0197394
ingame_exp~e |  -.0444885   .0102519    -4.34   0.000    -.0646638   -.0243132
accuracy_p~o |    .020229   .0208882     0.97   0.334    -.0208781    .0613362
       _cons |   .9339383   .0164236    56.87   0.000     .9016174    .9662592
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F3.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F3.tex
dir : seeout

. 
. // Appendix Table F.4
. 
. egen overcon_mean=mean(overconfidence)

. 
. reghdfe prediction_accuracy  gamified `controls_2'  ingame_experience accurac
> y_pred_zero if playerinner_name =="s2" & prediction_accuracy_std<=0 [pweight=
> prediction_confidence], absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        446
Absorbing 1 HDFE group                            F(  10,    274) =       1.60
Statistics robust to heteroskedasticity           Prob > F        =     0.1071
                                                  R-squared       =     0.0748
                                                  Adj R-squared   =     0.0470
                                                  Within R-sq.    =     0.0485
Number of clusters (participant_code) =        275Root MSE        =     0.0776

                     (Std. err. adjusted for 275 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0153848   .0075156    -2.05   0.042    -.0301804   -.0005892
     salient |  -.0051775   .0097957    -0.53   0.598    -.0244618    .0141069
     age_std |   .0025888   .0014061     1.84   0.067    -.0001793    .0053569
    d_gender |   .0152901   .0098151     1.56   0.120    -.0040326    .0346128
 finquiz_std |  -.0015252   .0041155    -0.37   0.711    -.0096273    .0065769
finknowled~d |   .0033614   .0064517     0.52   0.603    -.0093398    .0160626
playertrad~e |   .0028391   .0103372     0.27   0.784    -.0175113    .0231895
playercour~l |  -.0082684   .0153864    -0.54   0.591     -.038559    .0220223
ingame_exp~e |  -.0046637   .0079326    -0.59   0.557    -.0202804     .010953
accuracy_p~o |  -.0440356   .0169762    -2.59   0.010    -.0774559   -.0106153
       _cons |   .4945578   .0127395    38.82   0.000      .469478    .5196376
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F4.tex", adjr2 replace tex t
> stat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F4.tex
dir : seeout

. reghdfe prediction_accuracy  gamified `controls_2'  ingame_experience accurac
> y_pred_zero if playerinner_name =="s2" & prediction_accuracy_std>0  [pweight=
> prediction_confidence], absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        581
Absorbing 1 HDFE group                            F(  10,    298) =       3.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.1084
                                                  Adj R-squared   =     0.0880
                                                  Within R-sq.    =     0.0904
Number of clusters (participant_code) =        299Root MSE        =     0.1003

                     (Std. err. adjusted for 299 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0204022    .009065     2.25   0.025     .0025627    .0382417
     salient |   .0084279   .0092252     0.91   0.362    -.0097269    .0265826
     age_std |   .0024813   .0015682     1.58   0.115    -.0006048    .0055674
    d_gender |   .0283082   .0113177     2.50   0.013     .0060354    .0505809
 finquiz_std |   .0059847   .0056762     1.05   0.293    -.0051857    .0171552
finknowled~d |  -.0031189    .005838    -0.53   0.594    -.0146078    .0083701
playertrad~e |  -.0055179    .012056    -0.46   0.648    -.0292435    .0182078
playercour~l |  -.0086566   .0144292    -0.60   0.549    -.0370526    .0197394
ingame_exp~e |  -.0444885   .0102519    -4.34   0.000    -.0646638   -.0243132
accuracy_p~o |    .020229   .0208882     0.97   0.334    -.0208781    .0613362
       _cons |   .9339383   .0164236    56.87   0.000     .9016174    .9662592
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F4.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F4.tex
dir : seeout

. 
. reghdfe prediction_accuracy  gamified `controls_2'  ingame_experience accurac
> y_pred_zero if playerinner_name =="s2" & overconfidence>overcon_mean & predic
> tion_accuracy_std<=0 [pweight=prediction_confidence], absorb(round_number) vc
> e(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        199
Absorbing 1 HDFE group                            F(  10,    121) =       2.28
Statistics robust to heteroskedasticity           Prob > F        =     0.0176
                                                  R-squared       =     0.1705
                                                  Adj R-squared   =     0.1122
                                                  Within R-sq.    =     0.1504
Number of clusters (participant_code) =        122Root MSE        =     0.0757

                     (Std. err. adjusted for 122 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0452415   .0111757    -4.05   0.000    -.0673669   -.0231162
     salient |  -.0015268   .0141014    -0.11   0.914    -.0294443    .0263907
     age_std |   .0101548   .0092411     1.10   0.274    -.0081404      .02845
    d_gender |  -.0027814   .0140516    -0.20   0.843    -.0306001    .0250374
 finquiz_std |  -.0032704   .0082063    -0.40   0.691     -.019517    .0129761
finknowled~d |  -.0117477   .0108857    -1.08   0.283    -.0332989    .0098034
playertrad~e |   .0019633   .0125429     0.16   0.876    -.0228687    .0267952
playercour~l |  -.0225779   .0216416    -1.04   0.299    -.0654232    .0202673
ingame_exp~e |   -.011592   .0119811    -0.97   0.335    -.0353117    .0121277
accuracy_p~o |  -.0445429   .0252027    -1.77   0.080    -.0944382    .0053524
       _cons |   .5296443    .015975    33.15   0.000     .4980174    .5612711
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F4.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F4.tex
dir : seeout

. reghdfe prediction_accuracy  gamified `controls_2'  ingame_experience accurac
> y_pred_zero if playerinner_name =="s2" & overconfidence>overcon_mean & predic
> tion_accuracy_std>0 [pweight=prediction_confidence], absorb(round_number) vce
> (cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        257
Absorbing 1 HDFE group                            F(  10,    132) =       4.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1897
                                                  Adj R-squared   =     0.1464
                                                  Within R-sq.    =     0.1740
Number of clusters (participant_code) =        133Root MSE        =     0.1011

                     (Std. err. adjusted for 133 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0438051   .0150819     2.90   0.004     .0139716    .0736386
     salient |  -.0030209   .0131403    -0.23   0.819    -.0290137    .0229719
     age_std |   .0046159   .0140979     0.33   0.744    -.0232712     .032503
    d_gender |   .0371263   .0158933     2.34   0.021     .0056877    .0685648
 finquiz_std |  -.0060157   .0094723    -0.64   0.526    -.0247528    .0127214
finknowled~d |   .0076533   .0120779     0.63   0.527     -.016238    .0315446
playertrad~e |   .0043069   .0191115     0.23   0.822    -.0334976    .0421114
playercour~l |   -.014905   .0188381    -0.79   0.430    -.0521685    .0223586
ingame_exp~e |  -.0544884   .0148852    -3.66   0.000    -.0839329   -.0250439
accuracy_p~o |  -.0148216    .031292    -0.47   0.637    -.0767203     .047077
       _cons |    .923766   .0251255    36.77   0.000     .8740653    .9734666
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F4.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F4.tex
dir : seeout

. 
. reghdfe prediction_accuracy  gamified `controls_2'  ingame_experience accurac
> y_pred_zero if playerinner_name =="s2" & overconfidence<=overcon_mean & predi
> ction_accuracy_std<=0 [pweight=prediction_confidence], absorb(round_number) v
> ce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        247
Absorbing 1 HDFE group                            F(  10,    152) =       1.51
Statistics robust to heteroskedasticity           Prob > F        =     0.1394
                                                  R-squared       =     0.1110
                                                  Adj R-squared   =     0.0614
                                                  Within R-sq.    =     0.0809
Number of clusters (participant_code) =        153Root MSE        =     0.0764

                     (Std. err. adjusted for 153 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0059697   .0103581     0.58   0.565    -.0144948    .0264342
     salient |  -.0067594    .012988    -0.52   0.604    -.0324197     .018901
     age_std |   .0016129   .0012362     1.30   0.194    -.0008295    .0040554
    d_gender |   .0330421   .0137863     2.40   0.018     .0058045    .0602796
 finquiz_std |   .0065636   .0132076     0.50   0.620    -.0195305    .0326578
finknowled~d |   .0145809   .0095326     1.53   0.128    -.0042526    .0334144
playertrad~e |  -.0033216     .01418    -0.23   0.815    -.0313369    .0246936
playercour~l |   .0086095   .0208654     0.41   0.680    -.0326141    .0498331
ingame_exp~e |     .01163   .0120089     0.97   0.334    -.0120959    .0353559
accuracy_p~o |  -.0461527   .0250984    -1.84   0.068    -.0957394    .0034341
       _cons |   .4705626   .0244608    19.24   0.000     .4222356    .5188895
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F4.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F4.tex
dir : seeout

. reghdfe prediction_accuracy  gamified `controls_2'  ingame_experience accurac
> y_pred_zero if playerinner_name =="s2" & overconfidence<=overcon_mean & predi
> ction_accuracy_std>0 [pweight=prediction_confidence], absorb(round_number) vc
> e(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        324
Absorbing 1 HDFE group                            F(  10,    165) =       1.33
Statistics robust to heteroskedasticity           Prob > F        =     0.2193
                                                  R-squared       =     0.0951
                                                  Adj R-squared   =     0.0572
                                                  Within R-sq.    =     0.0661
Number of clusters (participant_code) =        166Root MSE        =     0.0978

                     (Std. err. adjusted for 166 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0037892   .0110266    -0.34   0.732    -.0255606    .0179821
     salient |   .0181149   .0127579     1.42   0.158    -.0070749    .0433047
     age_std |   .0020266   .0013447     1.51   0.134    -.0006285    .0046818
    d_gender |   .0228801   .0158784     1.44   0.151     -.008471    .0542312
 finquiz_std |   .0110535   .0116475     0.95   0.344    -.0119439    .0340508
finknowled~d |  -.0048495   .0115674    -0.42   0.676    -.0276887    .0179897
playertrad~e |  -.0086603   .0161699    -0.54   0.593     -.040587    .0232663
playercour~l |   .0005048   .0239406     0.02   0.983    -.0467647    .0477743
ingame_exp~e |  -.0332275   .0147069    -2.26   0.025    -.0622655   -.0041895
accuracy_p~o |   .0385538   .0290384     1.33   0.186     -.018781    .0958886
       _cons |   .9305417   .0239151    38.91   0.000     .8833225    .9777608
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F4.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F4.tex
dir : seeout

. 
. 
. 
. // Appendix Table F.5.
. 
. gen std_buy_prob_100=100*std_buy_prob
(400 missing values generated)

. gen std_sell_prob_100=100*std_sell_prob
(282 missing values generated)

. 
. reghdfe std_buy_prob_100 gamified if playerinner_name =="s2", absorb(round_nu
> mber) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        955
Absorbing 1 HDFE group                            F(   1,    307) =       0.64
Statistics robust to heteroskedasticity           Prob > F        =     0.4244
                                                  R-squared       =     0.1285
                                                  Adj R-squared   =     0.1249
                                                  Within R-sq.    =     0.0006
Number of clusters (participant_code) =        308Root MSE        =     1.6164

                     (Std. err. adjusted for 308 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
std_buy_~100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0777249   .0971768     0.80   0.424     -.113492    .2689418
       _cons |    2.65544   .0806854    32.91   0.000     2.496674    2.814206
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F5.tex", adjr2 replace tex t
> stat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F5.tex
dir : seeout

. reghdfe std_buy_prob_100 gamified  `controls' ingame_experience  if playerinn
> er_name =="s2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        950
Absorbing 1 HDFE group                            F(  10,    307) =       1.11
Statistics robust to heteroskedasticity           Prob > F        =     0.3516
                                                  R-squared       =     0.1380
                                                  Adj R-squared   =     0.1260
                                                  Within R-sq.    =     0.0148
Number of clusters (participant_code) =        308Root MSE        =     1.6100

                     (Std. err. adjusted for 308 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
std_buy_~100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0739267   .0971378     0.76   0.447    -.1172135    .2650669
     salient |   .0808226   .0961845     0.84   0.401    -.1084417    .2700868
     age_std |   .0198437   .0225889     0.88   0.380    -.0246049    .0642924
    d_gender |  -.0979426   .1312486    -0.75   0.456    -.3562033    .1603181
 finquiz_std |   -.158343   .0710808    -2.23   0.027    -.2982102   -.0184757
finknowled~d |   .1185872   .0720633     1.65   0.101    -.0232133    .2603876
playertrad~e |   -.096997   .1533868    -0.63   0.528    -.3988195    .2048255
playercour~l |  -.0227087    .173097    -0.13   0.896    -.3633152    .3178979
prediction~d |  -.0855357   .0555174    -1.54   0.124    -.1947785     .023707
ingame_exp~e |  -.0086147   .1272599    -0.07   0.946    -.2590266    .2417972
       _cons |   2.719236   .1538734    17.67   0.000     2.416456    3.022016
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F5.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F5.tex
dir : seeout

. reghdfe std_sell_prob_100 gamified if playerinner_name =="s2", absorb(round_n
> umber) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        981
Absorbing 1 HDFE group                            F(   1,    311) =       0.30
Statistics robust to heteroskedasticity           Prob > F        =     0.5868
                                                  R-squared       =     0.1092
                                                  Adj R-squared   =     0.1055
                                                  Within R-sq.    =     0.0003
Number of clusters (participant_code) =        312Root MSE        =     1.5987

                     (Std. err. adjusted for 312 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
std_sell~100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0528839   .0972153     0.54   0.587     -.138399    .2441668
       _cons |   2.876419   .0812389    35.41   0.000     2.716572    3.036266
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F5.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F5.tex
dir : seeout

. reghdfe std_sell_prob_100 gamified  `controls' ingame_experience  if playerin
> ner_name =="s2", absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        976
Absorbing 1 HDFE group                            F(  10,    311) =       1.18
Statistics robust to heteroskedasticity           Prob > F        =     0.3030
                                                  R-squared       =     0.1214
                                                  Adj R-squared   =     0.1095
                                                  Within R-sq.    =     0.0141
Number of clusters (participant_code) =        312Root MSE        =     1.5954

                     (Std. err. adjusted for 312 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
std_sell~100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0499978   .0984989     0.51   0.612    -.1438107    .2438063
     salient |  -.1481029   .0938914    -1.58   0.116    -.3328456    .0366399
     age_std |  -.0070624   .0195024    -0.36   0.718    -.0454357    .0313109
    d_gender |  -.0479012   .1292395    -0.37   0.711    -.3021955    .2063931
 finquiz_std |  -.1249363   .0651561    -1.92   0.056    -.2531388    .0032662
finknowled~d |   .0288023   .0673837     0.43   0.669    -.1037833    .1613879
playertrad~e |   .0997357   .1411553     0.71   0.480    -.1780045    .3774758
playercour~l |  -.3498711   .1656593    -2.11   0.035    -.6758258   -.0239165
prediction~d |   -.059839   .0559019    -1.07   0.285    -.1698328    .0501547
ingame_exp~e |  -.0395356   .1199713    -0.33   0.742    -.2755936    .1965224
       _cons |   2.994593   .1401017    21.37   0.000     2.718926     3.27026
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F5.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F5.tex
dir : seeout

. 
. reghdfe std_buy_prob_100 gamified  if playerinner_name =="s2" & prediction_ac
> curacy<1, absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        527
Absorbing 1 HDFE group                            F(   1,    278) =       0.00
Statistics robust to heteroskedasticity           Prob > F        =     0.9847
                                                  R-squared       =     0.1081
                                                  Adj R-squared   =     0.1012
                                                  Within R-sq.    =     0.0000
Number of clusters (participant_code) =        279Root MSE        =     1.5429

                     (Std. err. adjusted for 279 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
std_buy_~100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0023777   .1241114    -0.02   0.985    -.2466953    .2419399
       _cons |   2.544294   .0935815    27.19   0.000     2.360076    2.728513
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F5.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F5.tex
dir : seeout

. reghdfe std_buy_prob_100 gamified  `controls' ingame_experience  if playerinn
> er_name =="s2" & prediction_accuracy<1, absorb(round_number) vce(cl participa
> nt_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        527
Absorbing 1 HDFE group                            F(  10,    278) =       1.30
Statistics robust to heteroskedasticity           Prob > F        =     0.2314
                                                  R-squared       =     0.1288
                                                  Adj R-squared   =     0.1067
                                                  Within R-sq.    =     0.0232
Number of clusters (participant_code) =        279Root MSE        =     1.5382

                     (Std. err. adjusted for 279 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
std_buy_~100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0109224   .1261659    -0.09   0.931    -.2592842    .2374394
     salient |   .1368036   .1371585     1.00   0.319    -.1331975    .4068047
     age_std |   .0306593    .027209     1.13   0.261    -.0229025    .0842211
    d_gender |  -.2525864   .1514336    -1.67   0.096    -.5506886    .0455158
 finquiz_std |  -.1620999   .0923078    -1.76   0.080     -.343811    .0196112
finknowled~d |   .0580694   .0891208     0.65   0.515     -.117368    .2335067
playertrad~e |  -.1684787   .1813965    -0.93   0.354    -.5255638    .1886064
playercour~l |   .0095011   .1909558     0.05   0.960    -.3664019     .385404
prediction~d |  -.2297473   .1332715    -1.72   0.086    -.4920966    .0326021
ingame_exp~e |  -.0720919   .1498364    -0.48   0.631    -.3670499    .2228661
       _cons |   2.519375   .2073298    12.15   0.000     2.111239    2.927511
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F5.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F5.tex
dir : seeout

. reghdfe std_sell_prob_100 gamified if playerinner_name =="s2" & prediction_ac
> curacy<1, absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        541
Absorbing 1 HDFE group                            F(   1,    282) =       0.15
Statistics robust to heteroskedasticity           Prob > F        =     0.7009
                                                  R-squared       =     0.1568
                                                  Adj R-squared   =     0.1505
                                                  Within R-sq.    =     0.0003
Number of clusters (participant_code) =        283Root MSE        =     1.4898

                     (Std. err. adjusted for 283 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
std_sell~100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0481987   .1253563    -0.38   0.701    -.2949515    .1985542
       _cons |   2.736362   .0967315    28.29   0.000     2.545954    2.926769
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F5.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F5.tex
dir : seeout

. reghdfe std_sell_prob_100 gamified  `controls' ingame_experience   if playeri
> nner_name =="s2" & prediction_accuracy<1, absorb(round_number) vce(cl partici
> pant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        541
Absorbing 1 HDFE group                            F(  10,    282) =       0.97
Statistics robust to heteroskedasticity           Prob > F        =     0.4666
                                                  R-squared       =     0.1714
                                                  Adj R-squared   =     0.1510
                                                  Within R-sq.    =     0.0176
Number of clusters (participant_code) =        283Root MSE        =     1.4894

                     (Std. err. adjusted for 283 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
std_sell~100 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0608807   .1243476    -0.49   0.625     -.305648    .1838866
     salient |   .0289446   .1264825     0.23   0.819    -.2200251    .2779143
     age_std |   -.014499   .0206086    -0.70   0.482    -.0550652    .0260673
    d_gender |  -.0856871   .1471098    -0.58   0.561    -.3752598    .2038856
 finquiz_std |  -.0897199   .0862868    -1.04   0.299    -.2595679     .080128
finknowled~d |   .0187793   .0869837     0.22   0.829    -.1524405    .1899991
playertrad~e |   .1740828   .1648623     1.06   0.292    -.1504341    .4985997
playercour~l |  -.4711817    .185966    -2.53   0.012    -.8372395    -.105124
prediction~d |  -.1643046   .1332492    -1.23   0.219    -.4265939    .0979846
ingame_exp~e |  -.0195952   .1388792    -0.14   0.888    -.2929667    .2537762
       _cons |   2.617117   .1774612    14.75   0.000       2.2678    2.966434
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F5.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F5.tex
dir : seeout

. 
. 
. // Appendix Table F.6
. 
. label variable ds3 "$ d_\text{session III}$"

. label variable gamified_ds3 "Gamified $\times d_\text{session III}$"

. 
. 
. reghdfe plr_alerts  gamified gamified_ds3 ds3  `controls'  ingame_experience 
> accuracy_pred_zero if (playerinner_name =="s2" | playerinner_name =="s3") & (
> prediction_accuracy_std<=0), absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        670
Absorbing 1 HDFE group                            F(  13,    413) =       2.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0149
                                                  R-squared       =     0.1004
                                                  Adj R-squared   =     0.0784
                                                  Within R-sq.    =     0.0544
Number of clusters (participant_code) =        414Root MSE        =     0.1798

                     (Std. err. adjusted for 414 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  plr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0054797   .0123846     0.44   0.658     -.018865    .0298244
gamified_ds3 |   .0117994   .0277625     0.43   0.671     -.042774    .0663728
         ds3 |   .0233755    .022178     1.05   0.293    -.0202204    .0669713
     salient |  -.0248473   .0140092    -1.77   0.077    -.0523855    .0026909
     age_std |   .0025187   .0044918     0.56   0.575    -.0063109    .0113482
    d_gender |  -.0166893   .0202773    -0.82   0.411    -.0565488    .0231703
 finquiz_std |  -.0360934    .012169    -2.97   0.003    -.0600143   -.0121725
finknowled~d |   .0152577   .0090762     1.68   0.094    -.0025835     .033099
playertrad~e |   .0138111   .0251602     0.55   0.583    -.0356469     .063269
playercour~l |  -.0226367   .0227125    -1.00   0.320    -.0672833    .0220099
prediction~d |   .0061168   .0238908     0.26   0.798     -.040846    .0530796
ingame_exp~e |    .017939   .0179325     1.00   0.318    -.0173114    .0531895
accuracy_p~o |   .0581714   .0203611     2.86   0.004     .0181471    .0981958
       _cons |    .051582    .030097     1.71   0.087    -.0075805    .1107445
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F6.tex", adjr2 replace tex t
> stat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F6.tex
dir : seeout

. reghdfe plr_alerts  gamified gamified_ds3 ds3  `controls'  ingame_experience 
> accuracy_pred_zero if (playerinner_name =="s2" | playerinner_name =="s3") & (
> prediction_accuracy_std>0), absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        886
Absorbing 1 HDFE group                            F(  13,    445) =       2.63
Statistics robust to heteroskedasticity           Prob > F        =     0.0015
                                                  R-squared       =     0.0652
                                                  Adj R-squared   =     0.0480
                                                  Within R-sq.    =     0.0549
Number of clusters (participant_code) =        446Root MSE        =     0.1864

                     (Std. err. adjusted for 446 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  plr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0022733    .014596     0.16   0.876    -.0264123    .0309589
gamified_ds3 |   .0153308   .0274472     0.56   0.577    -.0386115    .0692731
         ds3 |   .0185125   .0225246     0.82   0.412    -.0257553    .0627804
     salient |  -.0339039   .0117985    -2.87   0.004    -.0570916   -.0107161
     age_std |  -.0009662   .0036875    -0.26   0.793    -.0082134    .0062809
    d_gender |  -.0077322    .015934    -0.49   0.628    -.0390475     .023583
 finquiz_std |  -.0259592   .0102058    -2.54   0.011    -.0460166   -.0059017
finknowled~d |   .0080525   .0095332     0.84   0.399    -.0106832    .0267883
playertrad~e |  -.0339932    .017138    -1.98   0.048    -.0676746   -.0003117
playercour~l |   .0070496   .0211242     0.33   0.739    -.0344659    .0485651
prediction~d |   .0276476   .0133917     2.06   0.040     .0013288    .0539664
ingame_exp~e |   .0049051   .0140911     0.35   0.728    -.0227883    .0325985
accuracy_p~o |   .0626637   .0237909     2.63   0.009     .0159073    .1094202
       _cons |   .0553058   .0220216     2.51   0.012     .0120266     .098585
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F6.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F6.tex
dir : seeout

. reghdfe pgr_alerts  gamified gamified_ds3 ds3  `controls'  ingame_experience 
> accuracy_pred_zero if (playerinner_name =="s2" | playerinner_name =="s3") & (
> prediction_accuracy_std<=0), absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        623
Absorbing 1 HDFE group                            F(  13,    401) =       1.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0316
                                                  R-squared       =     0.0686
                                                  Adj R-squared   =     0.0440
                                                  Within R-sq.    =     0.0382
Number of clusters (participant_code) =        402Root MSE        =     0.3810

                     (Std. err. adjusted for 402 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  pgr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |    .084586   .0382594     2.21   0.028     .0093721       .1598
gamified_ds3 |  -.0757051    .067351    -1.12   0.262    -.2081103    .0567001
         ds3 |   .0514775   .0464944     1.11   0.269    -.0399257    .1428807
     salient |    .046578    .031957     1.46   0.146    -.0162462    .1094022
     age_std |   .0040035   .0095045     0.42   0.674    -.0146814    .0226884
    d_gender |  -.0244615   .0324713    -0.75   0.452    -.0882966    .0393737
 finquiz_std |   .0252614   .0175638     1.44   0.151    -.0092673    .0597901
finknowled~d |   .0180676   .0168343     1.07   0.284    -.0150268     .051162
playertrad~e |   .0154891   .0369112     0.42   0.675    -.0570745    .0880526
playercour~l |  -.0820712   .0415543    -1.98   0.049    -.1637626   -.0003798
prediction~d |   .0155037   .0531958     0.29   0.771    -.0890737    .1200812
ingame_exp~e |  -.0825661   .0318766    -2.59   0.010    -.1452323      -.0199
accuracy_p~o |  -.0509016   .0602886    -0.84   0.399    -.1694228    .0676196
       _cons |   .5097524   .0671564     7.59   0.000     .3777299     .641775
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F6.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F6.tex
dir : seeout

. reghdfe pgr_alerts  gamified gamified_ds3 ds3  `controls'  ingame_experience 
> accuracy_pred_zero if (playerinner_name =="s2" | playerinner_name =="s3") & (
> prediction_accuracy_std>0), absorb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        810
Absorbing 1 HDFE group                            F(  13,    440) =       2.29
Statistics robust to heteroskedasticity           Prob > F        =     0.0063
                                                  R-squared       =     0.1218
                                                  Adj R-squared   =     0.1041
                                                  Within R-sq.    =     0.0346
Number of clusters (participant_code) =        441Root MSE        =     0.3661

                     (Std. err. adjusted for 441 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
  pgr_alerts | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0317965   .0336917     0.94   0.346    -.0344201     .098013
gamified_ds3 |  -.0323995   .0555242    -0.58   0.560    -.1415252    .0767262
         ds3 |   .0211491   .0384618     0.55   0.583    -.0544426    .0967409
     salient |   .0175048   .0250877     0.70   0.486    -.0318018    .0668115
     age_std |  -.0036395   .0103314    -0.35   0.725    -.0239445    .0166655
    d_gender |   -.035982   .0293378    -1.23   0.221    -.0936415    .0216776
 finquiz_std |   .0220729   .0161394     1.37   0.172     -.009647    .0537927
finknowled~d |   .0256266   .0158897     1.61   0.108    -.0056025    .0568557
playertrad~e |  -.0323671   .0330944    -0.98   0.329    -.0974099    .0326756
playercour~l |  -.0314169    .040813    -0.77   0.442    -.1116297    .0487958
prediction~d |  -.0080105   .0310934    -0.26   0.797    -.0691206    .0530996
ingame_exp~e |  -.0872315   .0294556    -2.96   0.003    -.1451227   -.0293403
accuracy_p~o |   .1171626   .0544484     2.15   0.032     .0101513    .2241738
       _cons |    .428877   .0555978     7.71   0.000     .3196068    .5381471
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F6.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F6.tex
dir : seeout

. reghdfe prediction_accuracy   gamified gamified_ds3 ds3  `controls_2'  ingame
> _experience accuracy_pred_zero if (playerinner_name =="s2" | playerinner_name
>  =="s3") & (prediction_accuracy_std<=0) [pweight=prediction_confidence], abso
> rb(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        660
Absorbing 1 HDFE group                            F(  12,    408) =       1.95
Statistics robust to heteroskedasticity           Prob > F        =     0.0272
                                                  R-squared       =     0.0741
                                                  Adj R-squared   =     0.0526
                                                  Within R-sq.    =     0.0567
Number of clusters (participant_code) =        409Root MSE        =     0.0782

                     (Std. err. adjusted for 409 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |  -.0160243   .0078092    -2.05   0.041    -.0313756    -.000673
gamified_ds3 |   .0203484   .0142243     1.43   0.153    -.0076136    .0483105
         ds3 |  -.0107077   .0106201    -1.01   0.314    -.0315847    .0101692
     salient |  -.0043435    .007752    -0.56   0.576    -.0195824    .0108954
     age_std |   .0026187   .0016286     1.61   0.109    -.0005828    .0058203
    d_gender |   .0110198   .0082791     1.33   0.184    -.0052551    .0272947
 finquiz_std |    .004813   .0039044     1.23   0.218    -.0028623    .0124883
finknowled~d |  -.0052116   .0054529    -0.96   0.340    -.0159308    .0055076
playertrad~e |   .0090395   .0090736     1.00   0.320    -.0087972    .0268763
playercour~l |   -.004916   .0130673    -0.38   0.707    -.0306036    .0207716
ingame_exp~e |  -.0012011   .0068164    -0.18   0.860    -.0146009    .0121986
accuracy_p~o |  -.0538435   .0155859    -3.45   0.001    -.0844823   -.0232048
       _cons |   .4949665   .0110968    44.60   0.000     .4731525    .5167804
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F6.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F6.tex
dir : seeout

. reghdfe prediction_accuracy   gamified gamified_ds3 ds3  `controls_2'  ingame
> _experience accuracy_pred_zero if (playerinner_name =="s2" | playerinner_name
>  =="s3") & (prediction_accuracy_std>0) [pweight=prediction_confidence], absor
> b(round_number) vce(cl participant_code)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =        876
Absorbing 1 HDFE group                            F(  12,    447) =       2.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0008
                                                  R-squared       =     0.0559
                                                  Adj R-squared   =     0.0395
                                                  Within R-sq.    =     0.0506
Number of clusters (participant_code) =        448Root MSE        =     0.1043

                     (Std. err. adjusted for 448 clusters in participant_code)
------------------------------------------------------------------------------
             |               Robust
prediction~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    gamified |   .0230096    .009019     2.55   0.011     .0052847    .0407345
gamified_ds3 |  -.0189622    .016374    -1.16   0.247    -.0511418    .0132174
         ds3 |   .0046173   .0135632     0.34   0.734    -.0220382    .0312727
     salient |   .0048264   .0079252     0.61   0.543    -.0107489    .0204017
     age_std |   .0039177   .0023102     1.70   0.091    -.0006225    .0084579
    d_gender |   .0238936   .0099631     2.40   0.017     .0043134    .0434739
 finquiz_std |   .0032243   .0050099     0.64   0.520    -.0066216    .0130701
finknowled~d |  -.0060278   .0055206    -1.09   0.275    -.0168774    .0048218
playertrad~e |   .0136024   .0112261     1.21   0.226    -.0084602     .035665
playercour~l |  -.0113217   .0134416    -0.84   0.400    -.0377383     .015095
ingame_exp~e |  -.0266572   .0091993    -2.90   0.004    -.0447365   -.0085779
accuracy_p~o |  -.0092902    .018463    -0.50   0.615    -.0455752    .0269948
       _cons |   .9299102    .015693    59.26   0.000      .899069    .9607514
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 round_number |         4           0           4     |
------------------------------------------------------+

. outreg2 using "`directory'\tables\appendix_table_F6.tex", adjr2 append tex ts
> tat label  dec(2) tdec(2) eqdrop(/) keep(*)
D:\Research\gamification_investor_behavior\tables\appendix_table_F6.tex
dir : seeout

. 
end of do-file
